{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Flightly\n",
    "\n",
    "Modelling 2015 US commercial airline flight queries using SQL and Neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Setup Neo4j Query Object Wrapper\n",
    "This object will allow us to receive the result of the query and also measure the time it takes for X number of queries to be completed."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "LINE_LIMIT = 20000"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import timeit\n",
    "\n",
    "neoconn = ('bolt://localhost:7687', 'neo4j', 'password')\n",
    "\n",
    "class NeoQuery(object):\n",
    "    def __init__(self, query):\n",
    "        url, user, password = neoconn\n",
    "        self._driver = GraphDatabase.driver(url, auth=(user, password))\n",
    "        self._query = query\n",
    "\n",
    "    def close(self):\n",
    "        self._driver.close()\n",
    "        \n",
    "    def query(self, times=1):\n",
    "        results = self._run_cypher()\n",
    "        time = timeit.timeit(self._run_cypher, number=times)\n",
    "        self.close()\n",
    "        return results, time\n",
    "        \n",
    "    def _run_cypher(self):\n",
    "        with self._driver.session() as session:\n",
    "            return session.run(self._query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Setup Postgres Query Wrapper"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "tmp = !pwd\n",
    "current_path = tmp[0]\n",
    "\n",
    "import psycopg2\n",
    "from psycopg2 import Error\n",
    "import timeit\n",
    "\n",
    "pgconn = ('kevin', '', '127.0.0.1', '5432', 'flightly')\n",
    "\n",
    "class PostgresQuery(object):\n",
    "    def __init__(self, query):\n",
    "        user, password, host, port, database = pgconn\n",
    "        self._query = query\n",
    "        try:\n",
    "            self._connection = psycopg2.connect(\n",
    "                user = user,\n",
    "                password = password,\n",
    "                host = host,\n",
    "                port = port,\n",
    "                database = database\n",
    "            )\n",
    "            self._cursor = self._connection.cursor()\n",
    "        except:\n",
    "            print(\"Failed to connect to PostgreSQL DB\")\n",
    "\n",
    "    def query(self, times=1):\n",
    "        try:\n",
    "            results = self._run_sql()\n",
    "            time = timeit.timeit(self._run_sql, number=times)\n",
    "            self._connection.commit()\n",
    "            return results, time\n",
    "        except (Exception, psycopg2.DatabaseError) as error :\n",
    "            print (\"Error while executing SQL command\", error)\n",
    "        finally:\n",
    "            self._cursor.close()\n",
    "            self._connection.close()\n",
    "    \n",
    "    def _run_sql(self):      \n",
    "        self._cursor.execute(self._query)\n",
    "        try:\n",
    "            return self._cursor.fetchall()\n",
    "        except:\n",
    "            return []"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Initialization queries\n",
    "Delete all of the existing nodes and relationships to start with clean slate.\n",
    "Then, load all the csv files into the DB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "init_queries = {\n",
    "    'delete_all': \"\"\"\n",
    "                   MATCH (n)\n",
    "                   DETACH DELETE n\n",
    "                   \"\"\",\n",
    "    'load_airlines': \"\"\"\n",
    "            LOAD CSV FROM 'file:///flightly/airlines.csv' AS line\n",
    "            CREATE (:Airline { name: line[1], iata: line[0]})\n",
    "            \"\"\",\n",
    "    'load_airports': \"\"\"\n",
    "            LOAD CSV FROM 'file:///flightly/airports.csv' AS line\n",
    "            CREATE (:Airport { name: line[1], iata: line[0], city: line[2], state: line[3], country: line[4], latitude: line[5], longitude: line[6]})\n",
    "            \"\"\",\n",
    "    'load_flights': f\"\"\"\n",
    "            USING PERIODIC COMMIT 1000\n",
    "            LOAD CSV FROM 'file:///flightly/flights.csv' AS line\n",
    "            WITH line LIMIT {LINE_LIMIT}\n",
    "            CREATE (:Flight {{ \n",
    "                year: line[0],\n",
    "                month: line[1],\n",
    "                day: line[2],\n",
    "                day_of_week: line[3],\n",
    "                airline: line[4],\n",
    "                flight_number: line[5],\n",
    "                tail_number: line[6],\n",
    "                origin_airport: line[7],\n",
    "                destination_airport: line[8],\n",
    "                scheduled_departure: line[9],\n",
    "                departure_time: line[10],\n",
    "                departure_delay: line[11],\n",
    "                taxi_out: line[12],\n",
    "                wheels_off: line[13],\n",
    "                scheduled_time: line[14],\n",
    "                elapsed_time: line[15],\n",
    "                air_time: line[16],\n",
    "                distance: line[17],\n",
    "                wheels_on: line[18],\n",
    "                taxi_in: line[19],\n",
    "                scheduled_arrival: line[20],\n",
    "                arrival_time: line[21],\n",
    "                arrival_delay: line[22],\n",
    "                diverted: line[23],\n",
    "                cancelled: line[24],\n",
    "                cancellation_reason: line[25],\n",
    "                air_system_delay: line[26],\n",
    "                security_delay: line[27],\n",
    "                airline_delay: line[28],\n",
    "                late_aircraft_delay: line[29],\n",
    "                weather_delay: line[30]\n",
    "            }})\n",
    "            CREATE (:Tail {{\n",
    "                number: line[6]\n",
    "            }})\n",
    "            \"\"\"\n",
    "}\n",
    "\n",
    "for query in init_queries.items():\n",
    "    NeoQuery(query[1]).query(0)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "init_queries = {\n",
    "    'drop_all_tables': \"\"\"\n",
    "        DROP SCHEMA public CASCADE;\n",
    "        CREATE SCHEMA public;\n",
    "        \n",
    "        GRANT ALL ON SCHEMA public TO postgres;\n",
    "        GRANT ALL ON SCHEMA public TO public;\n",
    "        \"\"\",\n",
    "    'create_airlines_table': \"\"\"\n",
    "        CREATE TABLE IF NOT EXISTS airlines (\n",
    "          iata text,\n",
    "          name text);\n",
    "        \"\"\",\n",
    "    'create_airports_table': \"\"\"\n",
    "        CREATE TABLE IF NOT EXISTS airports (\n",
    "          iata text,\n",
    "          name text,\n",
    "          city text,\n",
    "          state text,\n",
    "          country text,\n",
    "          latitude text,\n",
    "          longitude text\n",
    "          );\n",
    "        \"\"\",\n",
    "    'create_flights_table': \"\"\"\n",
    "        CREATE TABLE IF NOT EXISTS flights (\n",
    "            year text,\n",
    "            month text,\n",
    "            day text,\n",
    "            day_of_week text,\n",
    "            airline text,\n",
    "            flight_number text,\n",
    "            tail_number text,\n",
    "            origin_airport text,\n",
    "            destination_airport text,\n",
    "            scheduled_departure text,\n",
    "            departure_time text,\n",
    "            departure_delay text,\n",
    "            taxi_out text,\n",
    "            wheels_off text,\n",
    "            scheduled_time text,\n",
    "            elapsed_time text,\n",
    "            air_time text,\n",
    "            distance text,\n",
    "            wheels_on text,\n",
    "            taxi_in text,\n",
    "            scheduled_arrival text,\n",
    "            arrival_time text,\n",
    "            arrival_delay text,\n",
    "            diverted text,\n",
    "            cancelled text,\n",
    "            cancellation_reason text,\n",
    "            air_system_delay text,\n",
    "            security_delay text,\n",
    "            airline_delay text,\n",
    "            late_aircraft_delay text,\n",
    "            weather_delay text\n",
    "        );\n",
    "        \"\"\",\n",
    "    'load_airlines_csv': f\"\"\"\n",
    "        COPY airlines\n",
    "        FROM '{current_path}/csv/airlines.csv' DELIMITER ',' HEADER CSV;\n",
    "        \"\"\",\n",
    "    'load_airports_csv': f\"\"\"\n",
    "        COPY airports\n",
    "        FROM '{current_path}/csv/airports.csv' DELIMITER ',' HEADER CSV;\n",
    "        \"\"\",\n",
    "    'load_flights_csv': f\"\"\"\n",
    "        COPY flights\n",
    "        FROM PROGRAM 'head -{LINE_LIMIT+1} {current_path}/csv/flights.csv' DELIMITER ',' HEADER CSV;\n",
    "        \"\"\"\n",
    "}\n",
    "\n",
    "for query in init_queries.items():\n",
    "    PostgresQuery(query[1]).query(0)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Match queries\n",
    "Create the relationships that..."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "match_queries = {\n",
    "    'match_origin_airport': \"\"\"\n",
    "            MATCH (fl:Flight),(ap:Airport)\n",
    "            WHERE fl.origin_airport = ap.iata\n",
    "            CREATE (ap)-[r:HAS_DEPARTURE]->(fl)\n",
    "            RETURN type(r)\n",
    "            \"\"\",\n",
    "        \n",
    "    'match_destination_airport': \"\"\"\n",
    "            MATCH (fl:Flight),(ap:Airport)\n",
    "            WHERE fl.destination_airport = ap.iata\n",
    "            CREATE (fl)-[:FLIES_TO]->(ap)\n",
    "            \"\"\",\n",
    "    'match_airline': \"\"\"\n",
    "            MATCH (fl:Flight),(al:Airline)\n",
    "            WHERE fl.airline = al.iata\n",
    "            CREATE (fl)-[:OPERATED_BY]->(al)\n",
    "            \"\"\",\n",
    "    'match_tail': \"\"\"\n",
    "            MATCH (fl:Flight),(tl:Tail)\n",
    "            WHERE fl.tail_number = tl.number\n",
    "            CREATE (fl)-[:USES]->(tl)\n",
    "            \"\"\"\n",
    "}\n",
    "\n",
    "for query in match_queries.items():\n",
    "    NeoQuery(query[1]).query(0)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Single table queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2.8112205250000013\n",
      "0.9193670300000001\n",
      "['602', '1500', '409', '1167', '5498', '1012', '224', '977', '1256', '654', '5370', '5764', '1748', '729', '424', '1061', '296', '761', '725', '5299', '661', '4546', '1967', '731', '1070', '1524', '1001', '4498', '5622', '1440', '1610', '1620', '23', '5556', '1454', '6407', '6379', '6389', '709', '4401', '4993', '454', '1665', '4158', '815', '6378', '1161', '1688', '523', '1477', '792', '395', '5446', '549', '121', '6459', '245', '538', '3940', '6119', '5349', '5248', '382', '1272', '4284', '1684', '4712', '691', '761', '5447', '5626', '2259', '1185', '893', '195', '231', '632', '384', '2224', '3212', '1463', '139', '357', '6200', '2931', '3242', '1538', '3437', '1933', '1582', '4756', '6122', '2855', '5298', '1590', '1168', '810', '1551', '2485', '2839', '331', '2315', '2872', '3256', '3415', '906', '1437', '1534', '2813', '3138', '1703', '1169', '1412', '1759', '2246', '4722', '5904', '5694', '219', '2183', '2784', '3624', '5479', '4980', '5431', '202', '1058', '1452', '4377', '2836', '3181', '5978', '6159', '3075', '3094', '5295', '3164', '1375', '2356', '2877', '2757', '3274', '3965', '927', '380', '1620', '3460', '2632', '589', '1530', '1751', '302', '1201', '1693', '5691', '2838', '3180', '4730', '2023', '5436', '387', '2319', '2783', '2925', '3448', '4518', '2862', '219', '847', '1054', '1205', '3043', '3012', '2999', '2901', '865', '1693', '1563', '3058', '3475', '322', '1657', '2950', '3114', '5369', '1080', '3045', '186', '3004', '1566', '1763', '4589', '5919', '5925', '6149', '3456', '2646', '5161', '4670', '6188', '5364', '3956', '631', '1163', '758', '1723', '278', '6008', '3119', '5238', '1630', '1044', '3627', '2070', '2842', '2767', '3368', '3670', '2321', '4987', '521', '374', '3412', '1087', '1226', '159', '3228', '3356', '393', '5995', '719', '2361', '3132', '1685', '1343', '2752', '3266', '198', '6247', '682', '1065', '1679', '3686', '2941', '4992', '230', '1004', '1492', '2267', '3936', '4242', '4464', '4753', '2982', '3155', '3126', '3698', '5332', '5455', '1236', '5353', '5325', '416', '1233', '1606', '550', '4637', '1477', '3260', '3256', '4174', '4421', '6038', '5198', '4457', '5354', '3950', '368', '4294', '5726', '6167', '3101', '2325', '3020', '2635', '3172', '4973', '4512', '2863', '3339', '3423', '432', '5582', '552', '664', '1263', '3321', '5393', '474', '1502', '3934', '742', '231', '1644', '690', '3118', '1817', '197', '1067', '4509', '6165', '672', '1710', '1670', '4142', '3008', '409', '5413', '366', '2968', '3061', '659', '656', '1260', '2331', '2408', '4737', '2801', '2643', '1430', '155', '1135', '3258', '1141', '2890', '3289', '1583', '5737', '3637', '2335', '5903', '2854', '390', '985', '1432', '4103', '5994', '2849', '5924', '364', '1074', '2970', '3100', '1735', '1221', '2818', '983', '2826', '3028', '3072', '4990', '476', '4731', '4996', '1151', '2340', '3413', '3620', '29', '2929', '6225', '1290', '4334', '6469', '2917', '3469', '1555', '1612', '209', '2339', '1110', '5409', '1215', '1063', '3046', '245', '3097', '3498', '99', '6328', '151', '1612', '783', '690', '1419', '1475', '1605', '463', '2914', '3029', '1043', '4662', '360', '3073', '4349', '5361', '2640', '241', '1064', '2769', '1403', '3949', '4273', '2805', '2889', '5396', '1687', '5928', '2986', '2343', '6110', '5998', '4504', '1143', '1130', '1401', '2951', '518', '358', '3265', '3963', '1965', '475', '3297', '3108', '3585', '6365', '3263', '3947', '5339', '5566', '1271', '2992', '3244', '6314', '241', '1179', '354', '5201', '5205', '5408', '4727', '241', '2811', '3048', '4147', '563', '3227', '5412', '5233', '531', '2239', '3158', '3633', '93', '111', '5950', '6079', '3080', '3500', '5224', '223', '493', '1267', '5404', '2875', '2919', '3102', '6449', '333', '675', '6011', '425', '2636', '5511', '350', '2345', '4991', '2271', '1116', '6258', '2785', '1142', '5916', '5495', '6397', '624', '692', '1427', '2409', '6115', '3165', '630', '5329', '1196', '4742', '1623', '4110', '3003', '3961', '1094', '2823', '582', '1136', '5679', '1451', '3629', '349', '1037', '55', '352', '4311', '5236', '1268', '5922', '1796', '1459', '6164', '472', '112', '211', '1426', '2806', '1248', '2907', '3160', '685', '87', '1008', '1634', '2349', '903', '1251', '6153', '2796', '895', '3033', '1118', '4713', '1298', '1559', '2997', '3319', '545', '47', '346', '4278', '741', '3645', '1430', '21', '3964', '2641', '442', '1617', '2383', '5744', '3383', '6026', '530', '636', '1411', '4473', '2819', '2895', '3252', '5230', '1591', '1106', '1121', '347', '2932', '3068', '2637', '763', '154', '149', '1331', '4560', '2971', '3230', '3685', '4407', '295', '1680', '472', '288', '1150', '6028', '6129', '6087', '2761', '4237', '5607', '6437', '2284', '2457', '4743', '3039', '3201', '2644', '5229', '6198', '411', '1025', '2933', '3310', '565', '393', '1585', '6411', '1009', '2353', '2959', '5395', '2873', '2975', '627', '3070', '3152', '3233', '3226', '515', '3943', '1053', '2876', '2921', '1144', '1177', '41', '1384', '1398', '1592', '1760', '5378', '6030', '6034', '3107', '5300', '1555', '1115', '968', '4716', '2808', '2899', '3013', '4484', '532', '5905', '5407', '1235', '2374', '4752', '2825', '3037', '167', '5344', '5410', '1402', '5351', '1587', '2398', '2762', '2770', '3084', '759', '1259', '1650', '3078', '3344', '3139', '3306', '3113', '3019', '2221', '2346', '2910', '3405', '2382', '3174', '3642', '3315', '602', '1342', '1500', '409', '707', '1012', '1238', '1910', '224', '1018', '1256', '1896', '1078', '2301', '977', '1256', '1412', '1721', '654', '5370', '2886', '5582', '40', '2303', '1052', '5396', '1492', '4311', '5361', '394', '3430', '4152', '4466', '1450', '751', '121', '1715', '4993', '424', '1047', '957', '1061', '6438', '1127', '761', '1006', '6367', '4520', '1463', '4548', '4765', '3116', '5299', '661', '1537', '4546', '3283', '2077', '1395', '2473', '731', '578', '392', '2305', '2279', '2317', '1070', '2772', '3392', '1524', '392', '2759', '717', '4647', '3030', '4498', '4555', '5622', '628', '3277', '4478', '6014', '2981', '5995', '3', '1694', '201', '23', '2483', '4174', '6292', '1294', '1496', '6144', '3049', '3214', '6469', '6472', '6407', '3682', '6379', '6389', '709', '1454', '1075', '1444', '3953', '4401', '3151', '4509', '6153', '454', '1168', '4755', '6222', '3494', '815', '2634', '5903', '1688', '1202', '2309', '3458', '425', '725', '1628', '1477', '2829', '533', '388', '395', '1192', '2866', '2893', '3388', '1175', '3481', '729', '4137', '2787', '2633', '245', '538', '1435', '4662', '6119', '2850', '5349', '4990', '382', '1601', '3062', '3255', '3269', '2205', '3940', '3128', '1596', '4155', '759', '691', '3093', '3448', '761', '5447', '2259', '936', '6109', '2763', '3479', '3220', '5978', '2990', '3658', '893', '1606', '3206', '632', '231', '384', '2224', '3164', '3138', '3460', '206', '3212', '6305', '139', '2931', '357', '545', '1538', '3437', '1582', '4443', '5940', '5919', '6122', '2855', '5321', '1590', '810', '1073', '1551', '2485', '2839', '5446', '331', '1933', '2315', '2872', '3256', '3415', '906', '1135', '2813', '5556', '1630', '1169', '2246', '5904', '6030', '219', '2183', '2784', '3624', '5479', '4980', '5431', '202', '1037', '1452', '2836', '3181', '3075', '3094', '5312', '5804', '4085', '1375', '2356', '4729', '2877', '2757', '3274', '3965', '927', '1859', '380', '1620', '2632', '589', '1530', '3242', '302', '1201', '1693', '2838', '3180', '1751', '4730', '2023', '5436', '1450', '674', '1083', '2319', '2783', '2925', '4518', '219', '847', '1054']\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# all flights out of ORD\n",
    "\n",
    "nresults, ntime = NeoQuery(\n",
    "    \"\"\"\n",
    "    MATCH (fl:Flight {origin_airport: 'ORD'})\n",
    "    RETURN fl.flight_number\n",
    "    \"\"\"\n",
    ").query(100)\n",
    "\n",
    "presults, ptime = PostgresQuery(\n",
    "    \"\"\"\n",
    "    SELECT flight_number from flights where origin_airport = 'ORD'\n",
    "    \"\"\"\n",
    ").query(100)\n",
    "\n",
    "#time and results\n",
    "\n",
    "print(ntime)\n",
    "nresults = [record[0] for record in nresults]\n",
    "\n",
    "print(ptime)\n",
    "presults = [record[0] for record in presults]\n",
    "\n",
    "print(nresults)\n",
    "\n",
    "list(set(presults) - set(nresults))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5.520864553000003\n",
      "1.3462678709999985\n",
      "['1057', '824', '5976', '5547', '247', '1205', '943', '6420', '1492', '1966', '2522', '3432', '1207', '595', '705', '1195', '531', '1109', '2393', '110', '5242', '1499', '2567', '240', '4978', '3047', '2413', '6283', '337', '6458', '395', '974', '416', '567', '992', '258', '5518', '164', '749', '4712', '6323', '1623', '442', '6279', '4992', '169', '2591', '56', '3200', '1590', '5387', '43', '5315', '3492', '1532', '1221', '570', '5561', '5529', '1422', '2055', '239', '597', '4671', '1410', '5365', '123', '4479', '2389', '6183', '1531', '452', '4619', '4556', '1683', '5160', '1189', '1218', '3274', '306', '5919', '2317', '510', '1081', '2072', '7', '5384', '4264', '2773', '1437', '4540', '1605', '3214', '170', '5502', '5163', '5578', '6161', '820', '1180', '2417', '5', '4706', '5565', '2470', '399', '4447', '6011', '5183', '1391', '1263', '785', '489', '690', '5421', '1697', '821', '5997', '5204', '4654', '551', '305', '5171', '398', '386', '221', '2360', '598', '1636', '754', '4561', '2251', '6098', '5371', '2418', '3303', '4208', '1417', '203', '4989', '2809', '5498', '1987', '152', '1475', '1337', '1029', '5935', '2324', '586', '5212', '2639', '1149', '532', '1554', '1535', '942', '3118', '528', '287', '3226', '1091', '3647', '1668', '487', '51', '2922', '4526', '6538', '2345', '311', '2325', '1615', '4259', '1541', '8', '1116', '285', '3570', '60', '2478', '2466', '188', '741', '579', '2168', '928', '3590', '1502', '2774', '2157', '4840', '1704', '6213', '208', '1008', '2296', '6190', '1598', '4774', '3056', '1047', '156', '682', '102', '2524', '1355', '126', '822', '530', '1114', '5906', '6467', '457', '735', '2339', '4690', '763', '4541', '1643', '2534', '6256', '3659', '680', '5573', '1645', '2501', '2644', '4529', '3396', '380', '1537', '1439', '751', '1566', '1571', '1384', '1495', '1523', '2362', '1595', '581', '303', '2540', '4552', '1004', '5475', '2427', '2382', '1344', '2300', '1413', '697', '5465', '1840', '90', '6457', '4151', '2962', '3014', '3194', '6497', '1768', '612', '3609', '4809', '1158', '3443', '2775', '5291', '2253', '3082', '2407', '1703', '3188', '2319', '663', '2852', '130', '1408', '1232', '568', '4672', '5240', '5173', '4856', '245', '2250', '6322', '1752', '1146', '135', '1043', '1511', '6580', '2286', '5545', '44', '1444', '6228', '196', '1662', '388', '2263', '729', '5445', '455', '4169', '5534', '2215', '479', '5261', '6338', '1885', '1655', '2575', '297', '1217', '644', '1722', '587', '5614', '1132', '1629', '833', '290', '1175', '2210', '5458', '1927', '843', '358', '2278', '3301', '731', '1054', '5480']\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# all flights with a delay of more than 100 minutes\n",
    "\n",
    "nresults, ntime = NeoQuery(\n",
    "    \"\"\"\n",
    "    MATCH (fl:Flight)\n",
    "    WHERE toInteger(fl.departure_delay) > 100\n",
    "    RETURN DISTINCT fl.flight_number\n",
    "    \"\"\"\n",
    ").query(100)\n",
    "\n",
    "presults, ptime = PostgresQuery(\n",
    "    \"\"\"\n",
    "    SELECT flight_number from flights WHERE CAST (departure_delay AS INTEGER) > 100\n",
    "    \"\"\"\n",
    ").query(100)\n",
    "\n",
    "print(ntime)\n",
    "nresults = [record[0] for record in nresults]\n",
    "\n",
    "print(ptime)\n",
    "presults = [record[0] for record in presults]\n",
    "\n",
    "print(nresults)\n",
    "\n",
    "list(set(presults) - set(nresults))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Using Relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1.104647173\n",
      "2.1296228699999986\n",
      "['889', '447', '1805', '1808', '1808', '461', '1744', '1999', '2052', '1441', '2065', '1095', '2133', '1076', '461', '2251', '1095', '2065', '658']\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# flights departing from Atlanta and arriving in Charlotte\n",
    "\n",
    "nresults, ntime = NeoQuery(\n",
    "    \"\"\"\n",
    "    MATCH (atl:Airport {iata: 'ATL'})-[:HAS_DEPARTURE]->(fl:Flight)-[:FLIES_TO]->(clt:Airport {iata: 'CLT'})\n",
    "    RETURN fl.flight_number\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "presults, ptime = PostgresQuery(\n",
    "    \"\"\"\n",
    "    SELECT flight_number from flights WHERE origin_airport = 'ATL' AND destination_airport = 'CLT'\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "print(ntime)\n",
    "nresults = [record[0] for record in nresults]\n",
    "\n",
    "print(ptime)\n",
    "presults = [record[0] for record in presults]\n",
    "\n",
    "print(nresults)\n",
    "\n",
    "list(set(presults) - set(nresults))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2.190588023\n",
      "2.6001490329999974\n",
      "['531', '1004', '661', '1168', '1256', '1058', '1037', '521', '1151', '1665', '1591', '661', '1037', '1760', '865']\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# flights departing from Chicago and arriving in Los Angeles operated by United\n",
    "\n",
    "nresults, ntime = NeoQuery(\n",
    "    \"\"\"\n",
    "    MATCH (ord:Airport {iata: 'ORD'})-[:HAS_DEPARTURE]->(fl:Flight)-[:FLIES_TO]->(lax:Airport {iata: 'LAX'}),\n",
    "          (fl)-[:OPERATED_BY]->(ua:Airline {iata: 'UA'})\n",
    "    RETURN fl.flight_number\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "presults, ptime = PostgresQuery(\n",
    "    \"\"\"\n",
    "    SELECT flight_number from flights WHERE origin_airport = 'ORD' AND destination_airport = 'LAX' AND airline = 'UA'\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "print(ntime)\n",
    "nresults = [record[0] for record in nresults]\n",
    "\n",
    "print(ptime)\n",
    "presults = [record[0] for record in presults]\n",
    "\n",
    "print(nresults)\n",
    "\n",
    "list(set(presults) - set(nresults))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3.345743089999999\n",
      "2.7668735359999985\n",
      "['1058']\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# flights departing from Chicago and arriving in Los Angeles operated by United with Tail Number N33209\n",
    "\n",
    "nresults, ntime = NeoQuery(\n",
    "    \"\"\"\n",
    "    MATCH (ord:Airport {iata: 'ORD'})-[:HAS_DEPARTURE]->(fl:Flight)-[:FLIES_TO]->(lax:Airport {iata: 'LAX'}),\n",
    "          (fl)-[:OPERATED_BY]->(ua:Airline {iata: 'UA'}),\n",
    "          (fl)-[:USES]->(tl:Tail {number: 'N33209'})\n",
    "    RETURN DISTINCT fl.flight_number\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "presults, ptime = PostgresQuery(\n",
    "    \"\"\"\n",
    "    SELECT flight_number from flights WHERE origin_airport = 'ORD' AND destination_airport = 'LAX'\n",
    "    AND airline = 'UA' AND tail_number = 'N33209'\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "print(ntime)\n",
    "nresults = [record[0] for record in nresults]\n",
    "\n",
    "print(ptime)\n",
    "presults = [record[0] for record in presults]\n",
    "\n",
    "print(nresults)\n",
    "\n",
    "list(set(presults) - set(nresults))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Joining across tables"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1.7107797620000014\n",
      "3.2483375779999974\n",
      "['American Airlines Inc.', 'Spirit Air Lines', 'United Air Lines Inc.', 'Virgin America']\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# get names of the airlines operating flights from Chicago to Los Angeles\n",
    "\n",
    "nresults, ntime = NeoQuery(\n",
    "    \"\"\"\n",
    "    MATCH (ord:Airport {iata: 'ORD'})-[:HAS_DEPARTURE]->(fl:Flight)-[:FLIES_TO]->(lax:Airport {iata: 'LAX'}),\n",
    "          (fl)-[:OPERATED_BY]->(al:Airline)\n",
    "    RETURN DISTINCT al.name\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "presults, ptime = PostgresQuery(\n",
    "    \"\"\"\n",
    "    SELECT name from airlines INNER JOIN flights ON (airlines.iata = flights.airline)\n",
    "    WHERE origin_airport = 'ORD' AND destination_airport = 'LAX'\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "print(ntime)\n",
    "nresults = [record[0] for record in nresults]\n",
    "\n",
    "print(ptime)\n",
    "presults = [record[0] for record in presults]\n",
    "\n",
    "print(nresults)\n",
    "\n",
    "list(set(presults) - set(nresults))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0.3012527409999848\n",
      "2.547119858999963\n",
      "['San Francisco International Airport', 'Rock Springs-Sweetwater County Airport', 'Gillette-Campbell County Airport', 'Salt Lake City International Airport', \"Chicago O'Hare International Airport\", 'Los Angeles International Airport', 'Dallas/Fort Worth International Airport', 'Minneapolis-Saint Paul International Airport', 'Hartsfield-Jackson Atlanta International Airport', 'Newark Liberty International Airport', 'George Bush Intercontinental Airport', 'Denver International Airport']\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# get the names of destination airports from all flights originating in Wyoming\n",
    "\n",
    "nresults, ntime = NeoQuery(\n",
    "    \"\"\"\n",
    "    MATCH (hi:Airport {state: 'WY'})-[:HAS_DEPARTURE]->(fl:Flight)-[:FLIES_TO]->(ap:Airport)\n",
    "    RETURN DISTINCT ap.name\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "presults, ptime = PostgresQuery(\n",
    "    \"\"\"\n",
    "    SELECT name from airports\n",
    "    JOIN flights ON (airports.iata = flights.destination_airport)\n",
    "    where flights.origin_airport IN (SELECT iata from airports WHERE airports.state = 'WY')\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "print(ntime)\n",
    "nresults = [record[0] for record in nresults]\n",
    "\n",
    "print(ptime)\n",
    "presults = [record[0] for record in presults]\n",
    "\n",
    "print(nresults)\n",
    "\n",
    "list((set(presults) - set(nresults)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1.1603698410008292\n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0900 in Dallas/Fort Worth International Airport\n",
      "    80 minutes layover time.\n",
      "    Next leg departs at 1020 and lands at 1400 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0900 in Dallas/Fort Worth International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 1055 and lands at 1435 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0900 in Dallas/Fort Worth International Airport\n",
      "    95 minutes layover time.\n",
      "    Next leg departs at 1035 and lands at 1213 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0900 in Dallas/Fort Worth International Airport\n",
      "    80 minutes layover time.\n",
      "    Next leg departs at 1020 and lands at 1348 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0900 in Dallas/Fort Worth International Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 1005 and lands at 1303 in Tallahassee International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0900 in Dallas/Fort Worth International Airport\n",
      "    94 minutes layover time.\n",
      "    Next leg departs at 1034 and lands at 1356 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0900 in Dallas/Fort Worth International Airport\n",
      "    80 minutes layover time.\n",
      "    Next leg departs at 1020 and lands at 1335 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0900 in Dallas/Fort Worth International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 1055 and lands at 1243 in Destin-Fort Walton Beach Airport/Eglin AFB\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1700.\n",
      "    Arrival at 1901 in Hartsfield-Jackson Atlanta International Airport\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 2051 and lands at 2209 in Daytona Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1700.\n",
      "    Arrival at 1901 in Hartsfield-Jackson Atlanta International Airport\n",
      "    104 minutes layover time.\n",
      "    Next leg departs at 2045 and lands at 2235 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1700.\n",
      "    Arrival at 1901 in Hartsfield-Jackson Atlanta International Airport\n",
      "    79 minutes layover time.\n",
      "    Next leg departs at 2020 and lands at 2215 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1700.\n",
      "    Arrival at 1901 in Hartsfield-Jackson Atlanta International Airport\n",
      "    113 minutes layover time.\n",
      "    Next leg departs at 2054 and lands at 2204 in Gainesville Regional Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1700.\n",
      "    Arrival at 1901 in Hartsfield-Jackson Atlanta International Airport\n",
      "    104 minutes layover time.\n",
      "    Next leg departs at 2045 and lands at 2153 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1700.\n",
      "    Arrival at 1901 in Hartsfield-Jackson Atlanta International Airport\n",
      "    114 minutes layover time.\n",
      "    Next leg departs at 2055 and lands at 2224 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1700.\n",
      "    Arrival at 1901 in Hartsfield-Jackson Atlanta International Airport\n",
      "    119 minutes layover time.\n",
      "    Next leg departs at 2100 and lands at 2249 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1700.\n",
      "    Arrival at 1901 in Hartsfield-Jackson Atlanta International Airport\n",
      "    100 minutes layover time.\n",
      "    Next leg departs at 2041 and lands at 2204 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0900.\n",
      "    Arrival at 1100 in Hartsfield-Jackson Atlanta International Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 1205 and lands at 1322 in Daytona Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0900.\n",
      "    Arrival at 1100 in Hartsfield-Jackson Atlanta International Airport\n",
      "    74 minutes layover time.\n",
      "    Next leg departs at 1214 and lands at 1326 in Gainesville Regional Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0900.\n",
      "    Arrival at 1100 in Hartsfield-Jackson Atlanta International Airport\n",
      "    85 minutes layover time.\n",
      "    Next leg departs at 1225 and lands at 1350 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0900.\n",
      "    Arrival at 1100 in Hartsfield-Jackson Atlanta International Airport\n",
      "    72 minutes layover time.\n",
      "    Next leg departs at 1212 and lands at 1343 in Melbourne International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0900.\n",
      "    Arrival at 1100 in Hartsfield-Jackson Atlanta International Airport\n",
      "    80 minutes layover time.\n",
      "    Next leg departs at 1220 and lands at 1410 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0900.\n",
      "    Arrival at 1100 in Hartsfield-Jackson Atlanta International Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 1205 and lands at 1347 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0900.\n",
      "    Arrival at 1100 in Hartsfield-Jackson Atlanta International Airport\n",
      "    100 minutes layover time.\n",
      "    Next leg departs at 1240 and lands at 1405 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0900.\n",
      "    Arrival at 1100 in Hartsfield-Jackson Atlanta International Airport\n",
      "    90 minutes layover time.\n",
      "    Next leg departs at 1230 and lands at 1244 in Destin-Fort Walton Beach Airport/Eglin AFB\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1625.\n",
      "    Arrival at 1820 in Dallas Love Field\n",
      "    85 minutes layover time.\n",
      "    Next leg departs at 1945 and lands at 2310 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1625.\n",
      "    Arrival at 1820 in Dallas Love Field\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 2010 and lands at 2325 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1129.\n",
      "    Arrival at 1431 in Detroit Metropolitan Airport\n",
      "    83 minutes layover time.\n",
      "    Next leg departs at 1554 and lands at 1851 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1129.\n",
      "    Arrival at 1431 in Detroit Metropolitan Airport\n",
      "    69 minutes layover time.\n",
      "    Next leg departs at 1540 and lands at 1826 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1129.\n",
      "    Arrival at 1431 in Detroit Metropolitan Airport\n",
      "    88 minutes layover time.\n",
      "    Next leg departs at 1559 and lands at 1841 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1050.\n",
      "    Arrival at 1245 in Chicago Midway International Airport\n",
      "    90 minutes layover time.\n",
      "    Next leg departs at 1415 and lands at 1810 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1050.\n",
      "    Arrival at 1245 in Chicago Midway International Airport\n",
      "    75 minutes layover time.\n",
      "    Next leg departs at 1400 and lands at 1710 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1050.\n",
      "    Arrival at 1245 in Chicago Midway International Airport\n",
      "    75 minutes layover time.\n",
      "    Next leg departs at 1400 and lands at 1745 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1050.\n",
      "    Arrival at 1245 in Chicago Midway International Airport\n",
      "    105 minutes layover time.\n",
      "    Next leg departs at 1430 and lands at 1800 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0850.\n",
      "    Arrival at 1145 in Baltimore-Washington International Airport\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 1335 and lands at 1610 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0850.\n",
      "    Arrival at 1145 in Baltimore-Washington International Airport\n",
      "    84 minutes layover time.\n",
      "    Next leg departs at 1309 and lands at 1550 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0850.\n",
      "    Arrival at 1145 in Baltimore-Washington International Airport\n",
      "    95 minutes layover time.\n",
      "    Next leg departs at 1320 and lands at 1550 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0850.\n",
      "    Arrival at 1145 in Baltimore-Washington International Airport\n",
      "    105 minutes layover time.\n",
      "    Next leg departs at 1330 and lands at 1610 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1500.\n",
      "    Arrival at 1710 in Chicago O'Hare International Airport\n",
      "    113 minutes layover time.\n",
      "    Next leg departs at 1903 and lands at 2312 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1500.\n",
      "    Arrival at 1710 in Chicago O'Hare International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 1905 and lands at 2308 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1500.\n",
      "    Arrival at 1710 in Chicago O'Hare International Airport\n",
      "    83 minutes layover time.\n",
      "    Next leg departs at 1833 and lands at 2242 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1500.\n",
      "    Arrival at 1710 in Chicago O'Hare International Airport\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 1900 and lands at 2250 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1500.\n",
      "    Arrival at 1710 in Chicago O'Hare International Airport\n",
      "    95 minutes layover time.\n",
      "    Next leg departs at 1845 and lands at 2230 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1500.\n",
      "    Arrival at 1710 in Chicago O'Hare International Airport\n",
      "    61 minutes layover time.\n",
      "    Next leg departs at 1811 and lands at 2154 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1532.\n",
      "    Arrival at 1747 in Denver International Airport\n",
      "    73 minutes layover time.\n",
      "    Next leg departs at 1900 and lands at 0030 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1045.\n",
      "    Arrival at 1255 in Dallas/Fort Worth International Airport\n",
      "    90 minutes layover time.\n",
      "    Next leg departs at 1425 and lands at 1805 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1045.\n",
      "    Arrival at 1255 in Dallas/Fort Worth International Airport\n",
      "    95 minutes layover time.\n",
      "    Next leg departs at 1430 and lands at 1745 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1045.\n",
      "    Arrival at 1255 in Dallas/Fort Worth International Airport\n",
      "    80 minutes layover time.\n",
      "    Next leg departs at 1415 and lands at 1740 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1103.\n",
      "    Arrival at 1305 in Hartsfield-Jackson Atlanta International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 1500 and lands at 1655 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1103.\n",
      "    Arrival at 1305 in Hartsfield-Jackson Atlanta International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 1500 and lands at 1615 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1103.\n",
      "    Arrival at 1305 in Hartsfield-Jackson Atlanta International Airport\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 1455 and lands at 1624 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1103.\n",
      "    Arrival at 1305 in Hartsfield-Jackson Atlanta International Airport\n",
      "    118 minutes layover time.\n",
      "    Next leg departs at 1503 and lands at 1521 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1103.\n",
      "    Arrival at 1305 in Hartsfield-Jackson Atlanta International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 1500 and lands at 1635 in Sarasota-Bradenton International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1103.\n",
      "    Arrival at 1305 in Hartsfield-Jackson Atlanta International Airport\n",
      "    90 minutes layover time.\n",
      "    Next leg departs at 1435 and lands at 1600 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1440.\n",
      "    Arrival at 1636 in George Bush Intercontinental Airport\n",
      "    78 minutes layover time.\n",
      "    Next leg departs at 1754 and lands at 2105 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1145.\n",
      "    Arrival at 1335 in Dallas Love Field\n",
      "    70 minutes layover time.\n",
      "    Next leg departs at 1445 and lands at 1820 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1710.\n",
      "    Arrival at 1920 in Dallas/Fort Worth International Airport\n",
      "    80 minutes layover time.\n",
      "    Next leg departs at 2040 and lands at 0015 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1710.\n",
      "    Arrival at 1920 in Dallas/Fort Worth International Airport\n",
      "    75 minutes layover time.\n",
      "    Next leg departs at 2035 and lands at 0011 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1710.\n",
      "    Arrival at 1920 in Dallas/Fort Worth International Airport\n",
      "    75 minutes layover time.\n",
      "    Next leg departs at 2035 and lands at 0005 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1710.\n",
      "    Arrival at 1920 in Dallas/Fort Worth International Airport\n",
      "    70 minutes layover time.\n",
      "    Next leg departs at 2030 and lands at 2355 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1710.\n",
      "    Arrival at 1920 in Dallas/Fort Worth International Airport\n",
      "    80 minutes layover time.\n",
      "    Next leg departs at 2040 and lands at 2355 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0840.\n",
      "    Arrival at 1032 in George Bush Intercontinental Airport\n",
      "    95 minutes layover time.\n",
      "    Next leg departs at 1207 and lands at 1518 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0840.\n",
      "    Arrival at 1032 in George Bush Intercontinental Airport\n",
      "    118 minutes layover time.\n",
      "    Next leg departs at 1230 and lands at 1555 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0854 in Hartsfield-Jackson Atlanta International Airport\n",
      "    116 minutes layover time.\n",
      "    Next leg departs at 1050 and lands at 1102 in Northwest Florida Beaches International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0854 in Hartsfield-Jackson Atlanta International Airport\n",
      "    66 minutes layover time.\n",
      "    Next leg departs at 1000 and lands at 1200 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0854 in Hartsfield-Jackson Atlanta International Airport\n",
      "    81 minutes layover time.\n",
      "    Next leg departs at 1015 and lands at 1213 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0854 in Hartsfield-Jackson Atlanta International Airport\n",
      "    61 minutes layover time.\n",
      "    Next leg departs at 0955 and lands at 1102 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0854 in Hartsfield-Jackson Atlanta International Airport\n",
      "    61 minutes layover time.\n",
      "    Next leg departs at 0955 and lands at 1130 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0854 in Hartsfield-Jackson Atlanta International Airport\n",
      "    66 minutes layover time.\n",
      "    Next leg departs at 1000 and lands at 1202 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0854 in Hartsfield-Jackson Atlanta International Airport\n",
      "    96 minutes layover time.\n",
      "    Next leg departs at 1030 and lands at 1220 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0854 in Hartsfield-Jackson Atlanta International Airport\n",
      "    96 minutes layover time.\n",
      "    Next leg departs at 1030 and lands at 1206 in Sarasota-Bradenton International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0854 in Hartsfield-Jackson Atlanta International Airport\n",
      "    101 minutes layover time.\n",
      "    Next leg departs at 1035 and lands at 1203 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1412.\n",
      "    Arrival at 1609 in Hartsfield-Jackson Atlanta International Airport\n",
      "    66 minutes layover time.\n",
      "    Next leg departs at 1715 and lands at 1905 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1412.\n",
      "    Arrival at 1609 in Hartsfield-Jackson Atlanta International Airport\n",
      "    96 minutes layover time.\n",
      "    Next leg departs at 1745 and lands at 1852 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1412.\n",
      "    Arrival at 1609 in Hartsfield-Jackson Atlanta International Airport\n",
      "    116 minutes layover time.\n",
      "    Next leg departs at 1805 and lands at 1915 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1412.\n",
      "    Arrival at 1609 in Hartsfield-Jackson Atlanta International Airport\n",
      "    106 minutes layover time.\n",
      "    Next leg departs at 1755 and lands at 1925 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1412.\n",
      "    Arrival at 1609 in Hartsfield-Jackson Atlanta International Airport\n",
      "    66 minutes layover time.\n",
      "    Next leg departs at 1715 and lands at 1840 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1412.\n",
      "    Arrival at 1609 in Hartsfield-Jackson Atlanta International Airport\n",
      "    101 minutes layover time.\n",
      "    Next leg departs at 1750 and lands at 1948 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1412.\n",
      "    Arrival at 1609 in Hartsfield-Jackson Atlanta International Airport\n",
      "    86 minutes layover time.\n",
      "    Next leg departs at 1735 and lands at 1925 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1412.\n",
      "    Arrival at 1609 in Hartsfield-Jackson Atlanta International Airport\n",
      "    89 minutes layover time.\n",
      "    Next leg departs at 1738 and lands at 1751 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1412.\n",
      "    Arrival at 1609 in Hartsfield-Jackson Atlanta International Airport\n",
      "    76 minutes layover time.\n",
      "    Next leg departs at 1725 and lands at 1850 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1412.\n",
      "    Arrival at 1609 in Hartsfield-Jackson Atlanta International Airport\n",
      "    116 minutes layover time.\n",
      "    Next leg departs at 1805 and lands at 1930 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1051.\n",
      "    Arrival at 1248 in Hartsfield-Jackson Atlanta International Airport\n",
      "    62 minutes layover time.\n",
      "    Next leg departs at 1350 and lands at 1520 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1051.\n",
      "    Arrival at 1248 in Hartsfield-Jackson Atlanta International Airport\n",
      "    67 minutes layover time.\n",
      "    Next leg departs at 1355 and lands at 1525 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1051.\n",
      "    Arrival at 1248 in Hartsfield-Jackson Atlanta International Airport\n",
      "    62 minutes layover time.\n",
      "    Next leg departs at 1350 and lands at 1549 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1051.\n",
      "    Arrival at 1248 in Hartsfield-Jackson Atlanta International Airport\n",
      "    69 minutes layover time.\n",
      "    Next leg departs at 1357 and lands at 1549 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1051.\n",
      "    Arrival at 1248 in Hartsfield-Jackson Atlanta International Airport\n",
      "    67 minutes layover time.\n",
      "    Next leg departs at 1355 and lands at 1541 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1051.\n",
      "    Arrival at 1248 in Hartsfield-Jackson Atlanta International Airport\n",
      "    67 minutes layover time.\n",
      "    Next leg departs at 1355 and lands at 1501 in Tallahassee International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1051.\n",
      "    Arrival at 1248 in Hartsfield-Jackson Atlanta International Airport\n",
      "    107 minutes layover time.\n",
      "    Next leg departs at 1435 and lands at 1600 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1045.\n",
      "    Arrival at 1243 in Hartsfield-Jackson Atlanta International Airport\n",
      "    62 minutes layover time.\n",
      "    Next leg departs at 1345 and lands at 1539 in Key West International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1045.\n",
      "    Arrival at 1243 in Hartsfield-Jackson Atlanta International Airport\n",
      "    67 minutes layover time.\n",
      "    Next leg departs at 1350 and lands at 1520 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1045.\n",
      "    Arrival at 1243 in Hartsfield-Jackson Atlanta International Airport\n",
      "    72 minutes layover time.\n",
      "    Next leg departs at 1355 and lands at 1525 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1045.\n",
      "    Arrival at 1243 in Hartsfield-Jackson Atlanta International Airport\n",
      "    67 minutes layover time.\n",
      "    Next leg departs at 1350 and lands at 1549 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1045.\n",
      "    Arrival at 1243 in Hartsfield-Jackson Atlanta International Airport\n",
      "    74 minutes layover time.\n",
      "    Next leg departs at 1357 and lands at 1549 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1045.\n",
      "    Arrival at 1243 in Hartsfield-Jackson Atlanta International Airport\n",
      "    63 minutes layover time.\n",
      "    Next leg departs at 1346 and lands at 1401 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1045.\n",
      "    Arrival at 1243 in Hartsfield-Jackson Atlanta International Airport\n",
      "    72 minutes layover time.\n",
      "    Next leg departs at 1355 and lands at 1541 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1045.\n",
      "    Arrival at 1243 in Hartsfield-Jackson Atlanta International Airport\n",
      "    72 minutes layover time.\n",
      "    Next leg departs at 1355 and lands at 1501 in Tallahassee International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1045.\n",
      "    Arrival at 1243 in Hartsfield-Jackson Atlanta International Airport\n",
      "    112 minutes layover time.\n",
      "    Next leg departs at 1435 and lands at 1600 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1635.\n",
      "    Arrival at 1845 in Dallas/Fort Worth International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 2040 and lands at 0015 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1635.\n",
      "    Arrival at 1845 in Dallas/Fort Worth International Airport\n",
      "    90 minutes layover time.\n",
      "    Next leg departs at 2015 and lands at 2335 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1635.\n",
      "    Arrival at 1845 in Dallas/Fort Worth International Airport\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 2035 and lands at 0011 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1635.\n",
      "    Arrival at 1845 in Dallas/Fort Worth International Airport\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 2035 and lands at 0005 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1635.\n",
      "    Arrival at 1845 in Dallas/Fort Worth International Airport\n",
      "    105 minutes layover time.\n",
      "    Next leg departs at 2030 and lands at 2355 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1635.\n",
      "    Arrival at 1845 in Dallas/Fort Worth International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 2040 and lands at 2355 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1635.\n",
      "    Arrival at 1845 in Dallas/Fort Worth International Airport\n",
      "    85 minutes layover time.\n",
      "    Next leg departs at 2010 and lands at 2158 in Destin-Fort Walton Beach Airport/Eglin AFB\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1402.\n",
      "    Arrival at 1550 in Chicago O'Hare International Airport\n",
      "    100 minutes layover time.\n",
      "    Next leg departs at 1730 and lands at 2136 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1402.\n",
      "    Arrival at 1550 in Chicago O'Hare International Airport\n",
      "    91 minutes layover time.\n",
      "    Next leg departs at 1721 and lands at 2112 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1431.\n",
      "    Arrival at 1624 in Hartsfield-Jackson Atlanta International Airport\n",
      "    81 minutes layover time.\n",
      "    Next leg departs at 1745 and lands at 1852 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1431.\n",
      "    Arrival at 1624 in Hartsfield-Jackson Atlanta International Airport\n",
      "    101 minutes layover time.\n",
      "    Next leg departs at 1805 and lands at 1915 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1431.\n",
      "    Arrival at 1624 in Hartsfield-Jackson Atlanta International Airport\n",
      "    91 minutes layover time.\n",
      "    Next leg departs at 1755 and lands at 1925 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1431.\n",
      "    Arrival at 1624 in Hartsfield-Jackson Atlanta International Airport\n",
      "    86 minutes layover time.\n",
      "    Next leg departs at 1750 and lands at 1948 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1431.\n",
      "    Arrival at 1624 in Hartsfield-Jackson Atlanta International Airport\n",
      "    71 minutes layover time.\n",
      "    Next leg departs at 1735 and lands at 1925 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1431.\n",
      "    Arrival at 1624 in Hartsfield-Jackson Atlanta International Airport\n",
      "    74 minutes layover time.\n",
      "    Next leg departs at 1738 and lands at 1751 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1431.\n",
      "    Arrival at 1624 in Hartsfield-Jackson Atlanta International Airport\n",
      "    61 minutes layover time.\n",
      "    Next leg departs at 1725 and lands at 1850 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1431.\n",
      "    Arrival at 1624 in Hartsfield-Jackson Atlanta International Airport\n",
      "    101 minutes layover time.\n",
      "    Next leg departs at 1805 and lands at 1930 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1431.\n",
      "    Arrival at 1624 in Hartsfield-Jackson Atlanta International Airport\n",
      "    106 minutes layover time.\n",
      "    Next leg departs at 1810 and lands at 1825 in Destin-Fort Walton Beach Airport/Eglin AFB\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0655.\n",
      "    Arrival at 0905 in Chicago O'Hare International Airport\n",
      "    75 minutes layover time.\n",
      "    Next leg departs at 1020 and lands at 1343 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0655.\n",
      "    Arrival at 0905 in Chicago O'Hare International Airport\n",
      "    102 minutes layover time.\n",
      "    Next leg departs at 1047 and lands at 1429 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0655.\n",
      "    Arrival at 0905 in Chicago O'Hare International Airport\n",
      "    93 minutes layover time.\n",
      "    Next leg departs at 1038 and lands at 1415 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0655.\n",
      "    Arrival at 0905 in Chicago O'Hare International Airport\n",
      "    105 minutes layover time.\n",
      "    Next leg departs at 1050 and lands at 1420 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0655.\n",
      "    Arrival at 0905 in Chicago O'Hare International Airport\n",
      "    108 minutes layover time.\n",
      "    Next leg departs at 1053 and lands at 1435 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0655.\n",
      "    Arrival at 0905 in Chicago O'Hare International Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 1010 and lands at 1400 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0655.\n",
      "    Arrival at 0905 in Chicago O'Hare International Airport\n",
      "    90 minutes layover time.\n",
      "    Next leg departs at 1035 and lands at 1415 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1025.\n",
      "    Arrival at 1235 in Dallas/Fort Worth International Airport\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 1425 and lands at 1805 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1025.\n",
      "    Arrival at 1235 in Dallas/Fort Worth International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 1430 and lands at 1745 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1025.\n",
      "    Arrival at 1235 in Dallas/Fort Worth International Airport\n",
      "    100 minutes layover time.\n",
      "    Next leg departs at 1415 and lands at 1740 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1025.\n",
      "    Arrival at 1235 in Dallas/Fort Worth International Airport\n",
      "    77 minutes layover time.\n",
      "    Next leg departs at 1352 and lands at 1735 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1025.\n",
      "    Arrival at 1235 in Dallas/Fort Worth International Airport\n",
      "    70 minutes layover time.\n",
      "    Next leg departs at 1345 and lands at 1528 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1025.\n",
      "    Arrival at 1235 in Dallas/Fort Worth International Airport\n",
      "    80 minutes layover time.\n",
      "    Next leg departs at 1355 and lands at 1720 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1739.\n",
      "    Arrival at 1944 in Hartsfield-Jackson Atlanta International Airport\n",
      "    67 minutes layover time.\n",
      "    Next leg departs at 2051 and lands at 2209 in Daytona Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1739.\n",
      "    Arrival at 1944 in Hartsfield-Jackson Atlanta International Airport\n",
      "    61 minutes layover time.\n",
      "    Next leg departs at 2045 and lands at 2235 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1739.\n",
      "    Arrival at 1944 in Hartsfield-Jackson Atlanta International Airport\n",
      "    70 minutes layover time.\n",
      "    Next leg departs at 2054 and lands at 2204 in Gainesville Regional Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1739.\n",
      "    Arrival at 1944 in Hartsfield-Jackson Atlanta International Airport\n",
      "    61 minutes layover time.\n",
      "    Next leg departs at 2045 and lands at 2153 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1739.\n",
      "    Arrival at 1944 in Hartsfield-Jackson Atlanta International Airport\n",
      "    71 minutes layover time.\n",
      "    Next leg departs at 2055 and lands at 2224 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1739.\n",
      "    Arrival at 1944 in Hartsfield-Jackson Atlanta International Airport\n",
      "    106 minutes layover time.\n",
      "    Next leg departs at 2130 and lands at 2305 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1739.\n",
      "    Arrival at 1944 in Hartsfield-Jackson Atlanta International Airport\n",
      "    86 minutes layover time.\n",
      "    Next leg departs at 2110 and lands at 2302 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1739.\n",
      "    Arrival at 1944 in Hartsfield-Jackson Atlanta International Airport\n",
      "    78 minutes layover time.\n",
      "    Next leg departs at 2102 and lands at 2233 in Melbourne International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1739.\n",
      "    Arrival at 1944 in Hartsfield-Jackson Atlanta International Airport\n",
      "    76 minutes layover time.\n",
      "    Next leg departs at 2100 and lands at 2249 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1739.\n",
      "    Arrival at 1944 in Hartsfield-Jackson Atlanta International Airport\n",
      "    84 minutes layover time.\n",
      "    Next leg departs at 2108 and lands at 2215 in Tallahassee International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    112 minutes layover time.\n",
      "    Next leg departs at 1050 and lands at 1102 in Northwest Florida Beaches International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    62 minutes layover time.\n",
      "    Next leg departs at 1000 and lands at 1200 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    77 minutes layover time.\n",
      "    Next leg departs at 1015 and lands at 1213 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    117 minutes layover time.\n",
      "    Next leg departs at 1055 and lands at 1209 in Gainesville Regional Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    117 minutes layover time.\n",
      "    Next leg departs at 1055 and lands at 1230 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    62 minutes layover time.\n",
      "    Next leg departs at 1000 and lands at 1202 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    92 minutes layover time.\n",
      "    Next leg departs at 1030 and lands at 1220 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    119 minutes layover time.\n",
      "    Next leg departs at 1057 and lands at 1120 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    116 minutes layover time.\n",
      "    Next leg departs at 1054 and lands at 1242 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    92 minutes layover time.\n",
      "    Next leg departs at 1030 and lands at 1206 in Sarasota-Bradenton International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    97 minutes layover time.\n",
      "    Next leg departs at 1035 and lands at 1203 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1300.\n",
      "    Arrival at 1505 in Dallas/Fort Worth International Airport\n",
      "    96 minutes layover time.\n",
      "    Next leg departs at 1641 and lands at 2025 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1300.\n",
      "    Arrival at 1505 in Dallas/Fort Worth International Airport\n",
      "    105 minutes layover time.\n",
      "    Next leg departs at 1650 and lands at 1828 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1300.\n",
      "    Arrival at 1505 in Dallas/Fort Worth International Airport\n",
      "    70 minutes layover time.\n",
      "    Next leg departs at 1615 and lands at 1803 in Destin-Fort Walton Beach Airport/Eglin AFB\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1238.\n",
      "    Arrival at 1440 in George Bush Intercontinental Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 1545 and lands at 1910 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1238.\n",
      "    Arrival at 1440 in George Bush Intercontinental Airport\n",
      "    76 minutes layover time.\n",
      "    Next leg departs at 1556 and lands at 1908 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1238.\n",
      "    Arrival at 1440 in George Bush Intercontinental Airport\n",
      "    117 minutes layover time.\n",
      "    Next leg departs at 1637 and lands at 1804 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0630.\n",
      "    Arrival at 0845 in Dallas/Fort Worth International Airport\n",
      "    95 minutes layover time.\n",
      "    Next leg departs at 1020 and lands at 1400 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0630.\n",
      "    Arrival at 0845 in Dallas/Fort Worth International Airport\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 1035 and lands at 1213 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0630.\n",
      "    Arrival at 0845 in Dallas/Fort Worth International Airport\n",
      "    95 minutes layover time.\n",
      "    Next leg departs at 1020 and lands at 1348 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0630.\n",
      "    Arrival at 0845 in Dallas/Fort Worth International Airport\n",
      "    80 minutes layover time.\n",
      "    Next leg departs at 1005 and lands at 1303 in Tallahassee International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0630.\n",
      "    Arrival at 0845 in Dallas/Fort Worth International Airport\n",
      "    109 minutes layover time.\n",
      "    Next leg departs at 1034 and lands at 1356 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0630.\n",
      "    Arrival at 0845 in Dallas/Fort Worth International Airport\n",
      "    95 minutes layover time.\n",
      "    Next leg departs at 1020 and lands at 1335 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1105.\n",
      "    Arrival at 1310 in Dallas/Fort Worth International Airport\n",
      "    75 minutes layover time.\n",
      "    Next leg departs at 1425 and lands at 1805 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1105.\n",
      "    Arrival at 1310 in Dallas/Fort Worth International Airport\n",
      "    80 minutes layover time.\n",
      "    Next leg departs at 1430 and lands at 1745 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1105.\n",
      "    Arrival at 1310 in Dallas/Fort Worth International Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 1415 and lands at 1740 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1105.\n",
      "    Arrival at 1310 in Dallas/Fort Worth International Airport\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 1500 and lands at 1815 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    86 minutes layover time.\n",
      "    Next leg departs at 0932 and lands at 1051 in Daytona Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    69 minutes layover time.\n",
      "    Next leg departs at 0915 and lands at 0923 in Northwest Florida Beaches International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    99 minutes layover time.\n",
      "    Next leg departs at 0945 and lands at 1141 in Key West International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    104 minutes layover time.\n",
      "    Next leg departs at 0950 and lands at 1150 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    64 minutes layover time.\n",
      "    Next leg departs at 0910 and lands at 1105 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    114 minutes layover time.\n",
      "    Next leg departs at 1000 and lands at 1200 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    109 minutes layover time.\n",
      "    Next leg departs at 0955 and lands at 1102 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    109 minutes layover time.\n",
      "    Next leg departs at 0955 and lands at 1130 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    114 minutes layover time.\n",
      "    Next leg departs at 1000 and lands at 1202 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    86 minutes layover time.\n",
      "    Next leg departs at 0932 and lands at 1107 in Melbourne International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    67 minutes layover time.\n",
      "    Next leg departs at 0913 and lands at 1042 in Melbourne International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    105 minutes layover time.\n",
      "    Next leg departs at 0951 and lands at 1145 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    64 minutes layover time.\n",
      "    Next leg departs at 0910 and lands at 1055 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    74 minutes layover time.\n",
      "    Next leg departs at 0920 and lands at 1104 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    93 minutes layover time.\n",
      "    Next leg departs at 0939 and lands at 1123 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    69 minutes layover time.\n",
      "    Next leg departs at 0915 and lands at 1048 in Sarasota-Bradenton International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    89 minutes layover time.\n",
      "    Next leg departs at 0935 and lands at 1103 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    79 minutes layover time.\n",
      "    Next leg departs at 0925 and lands at 1055 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    104 minutes layover time.\n",
      "    Next leg departs at 0950 and lands at 1120 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1358.\n",
      "    Arrival at 1551 in Hartsfield-Jackson Atlanta International Airport\n",
      "    69 minutes layover time.\n",
      "    Next leg departs at 1700 and lands at 1852 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1358.\n",
      "    Arrival at 1551 in Hartsfield-Jackson Atlanta International Airport\n",
      "    84 minutes layover time.\n",
      "    Next leg departs at 1715 and lands at 1905 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1358.\n",
      "    Arrival at 1551 in Hartsfield-Jackson Atlanta International Airport\n",
      "    114 minutes layover time.\n",
      "    Next leg departs at 1745 and lands at 1852 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1358.\n",
      "    Arrival at 1551 in Hartsfield-Jackson Atlanta International Airport\n",
      "    84 minutes layover time.\n",
      "    Next leg departs at 1715 and lands at 1840 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1358.\n",
      "    Arrival at 1551 in Hartsfield-Jackson Atlanta International Airport\n",
      "    64 minutes layover time.\n",
      "    Next leg departs at 1655 and lands at 1821 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1358.\n",
      "    Arrival at 1551 in Hartsfield-Jackson Atlanta International Airport\n",
      "    119 minutes layover time.\n",
      "    Next leg departs at 1750 and lands at 1948 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1358.\n",
      "    Arrival at 1551 in Hartsfield-Jackson Atlanta International Airport\n",
      "    104 minutes layover time.\n",
      "    Next leg departs at 1735 and lands at 1925 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1358.\n",
      "    Arrival at 1551 in Hartsfield-Jackson Atlanta International Airport\n",
      "    107 minutes layover time.\n",
      "    Next leg departs at 1738 and lands at 1751 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1358.\n",
      "    Arrival at 1551 in Hartsfield-Jackson Atlanta International Airport\n",
      "    69 minutes layover time.\n",
      "    Next leg departs at 1700 and lands at 1840 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1358.\n",
      "    Arrival at 1551 in Hartsfield-Jackson Atlanta International Airport\n",
      "    94 minutes layover time.\n",
      "    Next leg departs at 1725 and lands at 1850 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0927.\n",
      "    Arrival at 1123 in Hartsfield-Jackson Atlanta International Airport\n",
      "    101 minutes layover time.\n",
      "    Next leg departs at 1304 and lands at 1310 in Northwest Florida Beaches International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0927.\n",
      "    Arrival at 1123 in Hartsfield-Jackson Atlanta International Airport\n",
      "    97 minutes layover time.\n",
      "    Next leg departs at 1300 and lands at 1452 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0927.\n",
      "    Arrival at 1123 in Hartsfield-Jackson Atlanta International Airport\n",
      "    102 minutes layover time.\n",
      "    Next leg departs at 1305 and lands at 1412 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0927.\n",
      "    Arrival at 1123 in Hartsfield-Jackson Atlanta International Airport\n",
      "    62 minutes layover time.\n",
      "    Next leg departs at 1225 and lands at 1350 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0927.\n",
      "    Arrival at 1123 in Hartsfield-Jackson Atlanta International Airport\n",
      "    77 minutes layover time.\n",
      "    Next leg departs at 1240 and lands at 1405 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0927.\n",
      "    Arrival at 1123 in Hartsfield-Jackson Atlanta International Airport\n",
      "    67 minutes layover time.\n",
      "    Next leg departs at 1230 and lands at 1244 in Destin-Fort Walton Beach Airport/Eglin AFB\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1720.\n",
      "    Arrival at 1930 in Dallas/Fort Worth International Airport\n",
      "    70 minutes layover time.\n",
      "    Next leg departs at 2040 and lands at 0015 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1720.\n",
      "    Arrival at 1930 in Dallas/Fort Worth International Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 2035 and lands at 0011 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1720.\n",
      "    Arrival at 1930 in Dallas/Fort Worth International Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 2035 and lands at 0005 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1720.\n",
      "    Arrival at 1930 in Dallas/Fort Worth International Airport\n",
      "    70 minutes layover time.\n",
      "    Next leg departs at 2040 and lands at 2355 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1518.\n",
      "    Arrival at 1711 in Hartsfield-Jackson Atlanta International Airport\n",
      "    119 minutes layover time.\n",
      "    Next leg departs at 1910 and lands at 2100 in Key West International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1518.\n",
      "    Arrival at 1711 in Hartsfield-Jackson Atlanta International Airport\n",
      "    104 minutes layover time.\n",
      "    Next leg departs at 1855 and lands at 2050 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1518.\n",
      "    Arrival at 1711 in Hartsfield-Jackson Atlanta International Airport\n",
      "    79 minutes layover time.\n",
      "    Next leg departs at 1830 and lands at 2025 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1518.\n",
      "    Arrival at 1711 in Hartsfield-Jackson Atlanta International Airport\n",
      "    104 minutes layover time.\n",
      "    Next leg departs at 1855 and lands at 2027 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1518.\n",
      "    Arrival at 1711 in Hartsfield-Jackson Atlanta International Airport\n",
      "    119 minutes layover time.\n",
      "    Next leg departs at 1910 and lands at 2106 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1518.\n",
      "    Arrival at 1711 in Hartsfield-Jackson Atlanta International Airport\n",
      "    99 minutes layover time.\n",
      "    Next leg departs at 1850 and lands at 2045 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0911.\n",
      "    Arrival at 1045 in George Bush Intercontinental Airport\n",
      "    82 minutes layover time.\n",
      "    Next leg departs at 1207 and lands at 1518 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0911.\n",
      "    Arrival at 1045 in George Bush Intercontinental Airport\n",
      "    105 minutes layover time.\n",
      "    Next leg departs at 1230 and lands at 1555 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0915.\n",
      "    Arrival at 1124 in Hartsfield-Jackson Atlanta International Airport\n",
      "    100 minutes layover time.\n",
      "    Next leg departs at 1304 and lands at 1310 in Northwest Florida Beaches International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0915.\n",
      "    Arrival at 1124 in Hartsfield-Jackson Atlanta International Airport\n",
      "    96 minutes layover time.\n",
      "    Next leg departs at 1300 and lands at 1452 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0915.\n",
      "    Arrival at 1124 in Hartsfield-Jackson Atlanta International Airport\n",
      "    101 minutes layover time.\n",
      "    Next leg departs at 1305 and lands at 1412 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0915.\n",
      "    Arrival at 1124 in Hartsfield-Jackson Atlanta International Airport\n",
      "    61 minutes layover time.\n",
      "    Next leg departs at 1225 and lands at 1350 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0915.\n",
      "    Arrival at 1124 in Hartsfield-Jackson Atlanta International Airport\n",
      "    76 minutes layover time.\n",
      "    Next leg departs at 1240 and lands at 1405 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0915.\n",
      "    Arrival at 1124 in Hartsfield-Jackson Atlanta International Airport\n",
      "    66 minutes layover time.\n",
      "    Next leg departs at 1230 and lands at 1244 in Destin-Fort Walton Beach Airport/Eglin AFB\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0750.\n",
      "    Arrival at 0926 in George Bush Intercontinental Airport\n",
      "    97 minutes layover time.\n",
      "    Next leg departs at 1103 and lands at 1424 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0750.\n",
      "    Arrival at 0926 in George Bush Intercontinental Airport\n",
      "    64 minutes layover time.\n",
      "    Next leg departs at 1030 and lands at 1342 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1318.\n",
      "    Arrival at 1544 in Chicago O'Hare International Airport\n",
      "    106 minutes layover time.\n",
      "    Next leg departs at 1730 and lands at 2136 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1318.\n",
      "    Arrival at 1544 in Chicago O'Hare International Airport\n",
      "    97 minutes layover time.\n",
      "    Next leg departs at 1721 and lands at 2112 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    69 minutes layover time.\n",
      "    Next leg departs at 0932 and lands at 1051 in Daytona Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    82 minutes layover time.\n",
      "    Next leg departs at 0945 and lands at 1141 in Key West International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    87 minutes layover time.\n",
      "    Next leg departs at 0950 and lands at 1150 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    97 minutes layover time.\n",
      "    Next leg departs at 1000 and lands at 1200 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    112 minutes layover time.\n",
      "    Next leg departs at 1015 and lands at 1213 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    92 minutes layover time.\n",
      "    Next leg departs at 0955 and lands at 1102 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    92 minutes layover time.\n",
      "    Next leg departs at 0955 and lands at 1130 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    97 minutes layover time.\n",
      "    Next leg departs at 1000 and lands at 1202 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    69 minutes layover time.\n",
      "    Next leg departs at 0932 and lands at 1107 in Melbourne International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    88 minutes layover time.\n",
      "    Next leg departs at 0951 and lands at 1145 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    76 minutes layover time.\n",
      "    Next leg departs at 0939 and lands at 1123 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    72 minutes layover time.\n",
      "    Next leg departs at 0935 and lands at 1103 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    62 minutes layover time.\n",
      "    Next leg departs at 0925 and lands at 1055 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    87 minutes layover time.\n",
      "    Next leg departs at 0950 and lands at 1120 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1210.\n",
      "    Arrival at 1400 in Dallas/Fort Worth International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 1555 and lands at 1921 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1210.\n",
      "    Arrival at 1400 in Dallas/Fort Worth International Airport\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 1550 and lands at 1915 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1210.\n",
      "    Arrival at 1400 in Dallas/Fort Worth International Airport\n",
      "    75 minutes layover time.\n",
      "    Next leg departs at 1515 and lands at 1858 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1210.\n",
      "    Arrival at 1400 in Dallas/Fort Worth International Airport\n",
      "    70 minutes layover time.\n",
      "    Next leg departs at 1510 and lands at 1653 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0600.\n",
      "    Arrival at 0750 in Dallas/Fort Worth International Airport\n",
      "    100 minutes layover time.\n",
      "    Next leg departs at 0930 and lands at 1255 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0600.\n",
      "    Arrival at 0750 in Dallas/Fort Worth International Airport\n",
      "    85 minutes layover time.\n",
      "    Next leg departs at 0915 and lands at 1250 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0600.\n",
      "    Arrival at 0750 in Dallas/Fort Worth International Airport\n",
      "    95 minutes layover time.\n",
      "    Next leg departs at 0925 and lands at 1250 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1300.\n",
      "    Arrival at 1512 in Hartsfield-Jackson Atlanta International Airport\n",
      "    98 minutes layover time.\n",
      "    Next leg departs at 1650 and lands at 1659 in Northwest Florida Beaches International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1300.\n",
      "    Arrival at 1512 in Hartsfield-Jackson Atlanta International Airport\n",
      "    108 minutes layover time.\n",
      "    Next leg departs at 1700 and lands at 1852 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1300.\n",
      "    Arrival at 1512 in Hartsfield-Jackson Atlanta International Airport\n",
      "    88 minutes layover time.\n",
      "    Next leg departs at 1640 and lands at 1752 in Gainesville Regional Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1300.\n",
      "    Arrival at 1512 in Hartsfield-Jackson Atlanta International Airport\n",
      "    103 minutes layover time.\n",
      "    Next leg departs at 1655 and lands at 1821 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1300.\n",
      "    Arrival at 1512 in Hartsfield-Jackson Atlanta International Airport\n",
      "    68 minutes layover time.\n",
      "    Next leg departs at 1620 and lands at 1750 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1300.\n",
      "    Arrival at 1512 in Hartsfield-Jackson Atlanta International Airport\n",
      "    108 minutes layover time.\n",
      "    Next leg departs at 1700 and lands at 1840 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1300.\n",
      "    Arrival at 1512 in Hartsfield-Jackson Atlanta International Airport\n",
      "    73 minutes layover time.\n",
      "    Next leg departs at 1625 and lands at 1809 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1300.\n",
      "    Arrival at 1512 in Hartsfield-Jackson Atlanta International Airport\n",
      "    83 minutes layover time.\n",
      "    Next leg departs at 1635 and lands at 1803 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1635.\n",
      "    Arrival at 1850 in Hartsfield-Jackson Atlanta International Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 1955 and lands at 2146 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1635.\n",
      "    Arrival at 1850 in Hartsfield-Jackson Atlanta International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 2045 and lands at 2235 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1635.\n",
      "    Arrival at 1850 in Hartsfield-Jackson Atlanta International Airport\n",
      "    90 minutes layover time.\n",
      "    Next leg departs at 2020 and lands at 2215 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1635.\n",
      "    Arrival at 1850 in Hartsfield-Jackson Atlanta International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 2045 and lands at 2153 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1635.\n",
      "    Arrival at 1850 in Hartsfield-Jackson Atlanta International Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 1955 and lands at 2123 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1635.\n",
      "    Arrival at 1850 in Hartsfield-Jackson Atlanta International Airport\n",
      "    70 minutes layover time.\n",
      "    Next leg departs at 2000 and lands at 2125 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1635.\n",
      "    Arrival at 1850 in Hartsfield-Jackson Atlanta International Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 1955 and lands at 2146 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1635.\n",
      "    Arrival at 1850 in Hartsfield-Jackson Atlanta International Airport\n",
      "    61 minutes layover time.\n",
      "    Next leg departs at 1951 and lands at 2007 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1635.\n",
      "    Arrival at 1850 in Hartsfield-Jackson Atlanta International Airport\n",
      "    69 minutes layover time.\n",
      "    Next leg departs at 1959 and lands at 2140 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1635.\n",
      "    Arrival at 1850 in Hartsfield-Jackson Atlanta International Airport\n",
      "    111 minutes layover time.\n",
      "    Next leg departs at 2041 and lands at 2204 in Tampa International Airport\n",
      "    \n"
     ]
    }
   ],
   "source": [
    "# get possible connection airports on a flight from Alask to Florida\n",
    "\n",
    "nresults, ntime = NeoQuery(\n",
    "    \"\"\"\n",
    "    MATCH (ap1:Airport {state: 'AL'})-[:HAS_DEPARTURE]->(fl:Flight)-[:FLIES_TO]->(ap:Airport),\n",
    "          (ap)-[:HAS_DEPARTURE]->(fl2:Flight)-[:FLIES_TO]->(ap2:Airport {state: 'FL'})\n",
    "          \n",
    "    WITH fl, fl2, ap, ap1, ap2,\n",
    "         toInteger(left(fl.scheduled_arrival, 2)) * 60 + toInteger(right(fl.scheduled_arrival, 2)) as fl_arrival,\n",
    "         toInteger(left(fl2.scheduled_departure, 2)) * 60 + toInteger(right(fl2.scheduled_departure, 2)) as fl2_departure  \n",
    "    \n",
    "    WHERE (fl2_departure - fl_arrival) > 60 AND (fl2_departure - fl_arrival) < 120 AND ap.state <> 'FL' AND fl.day = '1'\n",
    "    \n",
    "    RETURN DISTINCT ap1.name, fl.scheduled_departure, fl.scheduled_arrival, ap.name,\n",
    "                    fl2.scheduled_departure, fl2.scheduled_arrival, ap2.name, (fl2_departure - fl_arrival) as layover_time\n",
    "    \"\"\"\n",
    ").query(10)\n",
    "\n",
    "print(ntime)\n",
    "for record in nresults:\n",
    "    print(f\"\"\"\n",
    "    Flight departs from {record[0]} at {record[1]}.\n",
    "    Arrival at {record[2]} in {record[3]}\n",
    "    {record[7]} minutes layover time.\n",
    "    Next leg departs at {record[4]} and lands at {record[5]} in {record[6]}\n",
    "    \"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "6.334895058999997\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "['314',\n",
       " '17',\n",
       " '356',\n",
       " '1513',\n",
       " '1652',\n",
       " '276',\n",
       " '1635',\n",
       " '1513',\n",
       " '1473',\n",
       " '194',\n",
       " '1455',\n",
       " '232',\n",
       " '1455',\n",
       " '349',\n",
       " '1635',\n",
       " '1652',\n",
       " '17',\n",
       " '125']"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results, time = NeoQuery(\n",
    "    \"\"\"\n",
    "    MATCH (ord:Airport {iata: 'ATL'})-[:HAS_DEPARTURE]->(fl:Flight)-[:OPERATED_BY]->(al:Airline {iata: 'AA'})\n",
    "    RETURN fl\n",
    "    \"\"\"\n",
    ").query(500)\n",
    "\n",
    "print(time)\n",
    "[record['fl']['flight_number'] for record in results]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4.48958657\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "['889',\n",
       " '447',\n",
       " '1805',\n",
       " '1808',\n",
       " '1808',\n",
       " '461',\n",
       " '1744',\n",
       " '1999',\n",
       " '2052',\n",
       " '1441',\n",
       " '2065',\n",
       " '1095',\n",
       " '2133',\n",
       " '1076',\n",
       " '461',\n",
       " '2251',\n",
       " '1095',\n",
       " '2065',\n",
       " '658']"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results, time = NeoQuery(\n",
    "    \"\"\"\n",
    "    MATCH (:Airport {iata: 'ATL'})-[:HAS_DEPARTURE]->(fl:Flight)-[:FLIES_TO]->(ar:Airport {iata: 'CLT'})\n",
    "    RETURN fl\n",
    "    \"\"\"\n",
    ").query(500)\n",
    "\n",
    "print(time)\n",
    "[record['fl']['flight_number'] for record in results]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Query for All flights with a specific tail number"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2.9167485919999976\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[<Record fl=<Node id=466784 labels={'Flight'} properties={'wheels_off': '1422', 'taxi_in': '7', 'distance': '2139', 'year': '2015', 'scheduled_time': '269', 'scheduled_arrival': '2139', 'diverted': '0', 'taxi_out': '12', 'tail_number': 'N129DL', 'elapsed_time': '258', 'air_time': '239', 'airline': 'DL', 'departure_time': '1410', 'day': '1', 'departure_delay': '0', 'day_of_week': '4', 'arrival_time': '2128', 'wheels_on': '2121', 'flight_number': '61', 'origin_airport': 'SFO', 'destination_airport': 'ATL', 'month': '1', 'cancelled': '0', 'scheduled_departure': '1410', 'arrival_delay': '-11'}>>,\n",
       " <Record fl=<Node id=494253 labels={'Flight'} properties={'wheels_off': '0729', 'taxi_in': '7', 'distance': '1590', 'year': '2015', 'scheduled_time': '260', 'scheduled_arrival': '0940', 'diverted': '0', 'taxi_out': '11', 'tail_number': 'N129DL', 'elapsed_time': '238', 'air_time': '220', 'airline': 'DL', 'departure_time': '0718', 'day': '2', 'departure_delay': '-2', 'day_of_week': '5', 'arrival_time': '0916', 'wheels_on': '0909', 'flight_number': '331', 'origin_airport': 'ATL', 'destination_airport': 'SLC', 'month': '1', 'cancelled': '0', 'scheduled_departure': '0720', 'arrival_delay': '-24'}>>,\n",
       " <Record fl=<Node id=460084 labels={'Flight'} properties={'wheels_off': '1100', 'taxi_in': '8', 'distance': '2139', 'year': '2015', 'scheduled_time': '330', 'scheduled_arrival': '1310', 'diverted': '0', 'taxi_out': '17', 'tail_number': 'N129DL', 'elapsed_time': '302', 'air_time': '277', 'airline': 'DL', 'departure_time': '1043', 'day': '1', 'departure_delay': '3', 'day_of_week': '4', 'arrival_time': '1245', 'wheels_on': '1237', 'flight_number': '1680', 'origin_airport': 'ATL', 'destination_airport': 'SFO', 'month': '1', 'cancelled': '0', 'scheduled_departure': '1040', 'arrival_delay': '-25'}>>,\n",
       " <Record fl=<Node id=501893 labels={'Flight'} properties={'wheels_off': '1108', 'taxi_in': '7', 'distance': '1590', 'year': '2015', 'scheduled_time': '212', 'scheduled_arrival': '1632', 'diverted': '0', 'taxi_out': '12', 'tail_number': 'N129DL', 'elapsed_time': '202', 'air_time': '183', 'airline': 'DL', 'departure_time': '1056', 'day': '2', 'departure_delay': '-4', 'day_of_week': '5', 'arrival_time': '1618', 'wheels_on': '1611', 'flight_number': '1912', 'origin_airport': 'SLC', 'destination_airport': 'ATL', 'month': '1', 'cancelled': '0', 'scheduled_departure': '1100', 'arrival_delay': '-14'}>>]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results, time = NeoQuery(\n",
    "    \"\"\"\n",
    "    MATCH (ar:Airport)-[:HAS_DEPARTURE]->(fl:Flight)-[:USES]->(tl:Tail {number: 'N129DL'})\n",
    "    RETURN distinct fl\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "print(time)\n",
    "[record for record in results]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Query for all flights with specific tail number, but this query is slower"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "9.947114249000009\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[<Record fl=<Node id=460084 labels={'Flight'} properties={'wheels_off': '1100', 'taxi_in': '8', 'distance': '2139', 'year': '2015', 'scheduled_time': '330', 'scheduled_arrival': '1310', 'diverted': '0', 'taxi_out': '17', 'tail_number': 'N129DL', 'elapsed_time': '302', 'air_time': '277', 'airline': 'DL', 'departure_time': '1043', 'day': '1', 'departure_delay': '3', 'day_of_week': '4', 'arrival_time': '1245', 'wheels_on': '1237', 'flight_number': '1680', 'origin_airport': 'ATL', 'destination_airport': 'SFO', 'month': '1', 'cancelled': '0', 'scheduled_departure': '1040', 'arrival_delay': '-25'}>>,\n",
       " <Record fl=<Node id=494253 labels={'Flight'} properties={'wheels_off': '0729', 'taxi_in': '7', 'distance': '1590', 'year': '2015', 'scheduled_time': '260', 'scheduled_arrival': '0940', 'diverted': '0', 'taxi_out': '11', 'tail_number': 'N129DL', 'elapsed_time': '238', 'air_time': '220', 'airline': 'DL', 'departure_time': '0718', 'day': '2', 'departure_delay': '-2', 'day_of_week': '5', 'arrival_time': '0916', 'wheels_on': '0909', 'flight_number': '331', 'origin_airport': 'ATL', 'destination_airport': 'SLC', 'month': '1', 'cancelled': '0', 'scheduled_departure': '0720', 'arrival_delay': '-24'}>>,\n",
       " <Record fl=<Node id=466784 labels={'Flight'} properties={'wheels_off': '1422', 'taxi_in': '7', 'distance': '2139', 'year': '2015', 'scheduled_time': '269', 'scheduled_arrival': '2139', 'diverted': '0', 'taxi_out': '12', 'tail_number': 'N129DL', 'elapsed_time': '258', 'air_time': '239', 'airline': 'DL', 'departure_time': '1410', 'day': '1', 'departure_delay': '0', 'day_of_week': '4', 'arrival_time': '2128', 'wheels_on': '2121', 'flight_number': '61', 'origin_airport': 'SFO', 'destination_airport': 'ATL', 'month': '1', 'cancelled': '0', 'scheduled_departure': '1410', 'arrival_delay': '-11'}>>,\n",
       " <Record fl=<Node id=501893 labels={'Flight'} properties={'wheels_off': '1108', 'taxi_in': '7', 'distance': '1590', 'year': '2015', 'scheduled_time': '212', 'scheduled_arrival': '1632', 'diverted': '0', 'taxi_out': '12', 'tail_number': 'N129DL', 'elapsed_time': '202', 'air_time': '183', 'airline': 'DL', 'departure_time': '1056', 'day': '2', 'departure_delay': '-4', 'day_of_week': '5', 'arrival_time': '1618', 'wheels_on': '1611', 'flight_number': '1912', 'origin_airport': 'SLC', 'destination_airport': 'ATL', 'month': '1', 'cancelled': '0', 'scheduled_departure': '1100', 'arrival_delay': '-14'}>>]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results, time = NeoQuery(\n",
    "    \"\"\"\n",
    "    MATCH (ar:Airport)-[:HAS_DEPARTURE]->(fl:Flight {tail_number: 'N129DL'})\n",
    "    RETURN fl\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "print(time)\n",
    "[record for record in results]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
