{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Flightly\n",
    "\n",
    "Modelling 2015 US commercial airline flight queries using SQL and Neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Setup Neo4j Query Object Wrapper\n",
    "This object will allow us to receive the result of the query and also measure the time it takes for X number of queries to be completed."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "LINE_LIMIT = 20000"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import timeit\n",
    "\n",
    "neoconn = ('bolt://localhost:7687', 'neo4j', 'password')\n",
    "\n",
    "class NeoQuery(object):\n",
    "    def __init__(self, query):\n",
    "        url, user, password = neoconn\n",
    "        self._driver = GraphDatabase.driver(url, auth=(user, password))\n",
    "        self._query = query\n",
    "\n",
    "    def close(self):\n",
    "        self._driver.close()\n",
    "        \n",
    "    def query(self, times=1):\n",
    "        results = self._run_cypher()\n",
    "        time = timeit.timeit(self._run_cypher, number=times)\n",
    "        self.close()\n",
    "        return results, time\n",
    "        \n",
    "    def _run_cypher(self):\n",
    "        with self._driver.session() as session:\n",
    "            return session.run(self._query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Setup Postgres Query Wrapper"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "tmp = !pwd\n",
    "current_path = tmp[0]\n",
    "\n",
    "import psycopg2\n",
    "from psycopg2 import Error\n",
    "import timeit\n",
    "\n",
    "pgconn = ('kevin', '', '127.0.0.1', '5432', 'flightly')\n",
    "\n",
    "class PostgresQuery(object):\n",
    "    def __init__(self, query):\n",
    "        user, password, host, port, database = pgconn\n",
    "        self._query = query\n",
    "        try:\n",
    "            self._connection = psycopg2.connect(\n",
    "                user = user,\n",
    "                password = password,\n",
    "                host = host,\n",
    "                port = port,\n",
    "                database = database\n",
    "            )\n",
    "            self._cursor = self._connection.cursor()\n",
    "        except:\n",
    "            print(\"Failed to connect to PostgreSQL DB\")\n",
    "\n",
    "    def query(self, times=1):\n",
    "        try:\n",
    "            results = self._run_sql()\n",
    "            time = timeit.timeit(self._run_sql, number=times)\n",
    "            self._connection.commit()\n",
    "            return results, time\n",
    "        except (Exception, psycopg2.DatabaseError) as error :\n",
    "            print (\"Error while executing SQL command\", error)\n",
    "        finally:\n",
    "            self._cursor.close()\n",
    "            self._connection.close()\n",
    "    \n",
    "    def _run_sql(self):      \n",
    "        self._cursor.execute(self._query)\n",
    "        try:\n",
    "            return self._cursor.fetchall()\n",
    "        except:\n",
    "            return []"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Initialization queries\n",
    "Delete all of the existing nodes and relationships to start with clean slate.\n",
    "Then, load all the csv files into the DB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "init_queries = {\n",
    "    'delete_all': \"\"\"\n",
    "            MATCH (n)\n",
    "            DETACH DELETE n\n",
    "            \"\"\",\n",
    "    'load_airlines': \"\"\"\n",
    "            LOAD CSV FROM 'file:///flightly/airlines.csv' AS line\n",
    "            CREATE (:Airline { name: line[1], iata: line[0]})\n",
    "            \"\"\",\n",
    "    'load_airports': \"\"\"\n",
    "            LOAD CSV FROM 'file:///flightly/airports.csv' AS line\n",
    "            CREATE (:Airport { name: line[1], iata: line[0], city: line[2], state: line[3], country: line[4], latitude: line[5], longitude: line[6]})\n",
    "            \"\"\",\n",
    "    'load_flights': f\"\"\"\n",
    "            USING PERIODIC COMMIT 1000\n",
    "            LOAD CSV FROM 'file:///flightly/flights.csv' AS line\n",
    "            WITH line LIMIT {LINE_LIMIT}\n",
    "            CREATE (:Flight {{ \n",
    "                year: line[0],\n",
    "                month: line[1],\n",
    "                day: line[2],\n",
    "                day_of_week: line[3],\n",
    "                airline: line[4],\n",
    "                flight_number: line[5],\n",
    "                tail_number: line[6],\n",
    "                origin_airport: line[7],\n",
    "                destination_airport: line[8],\n",
    "                scheduled_departure: line[9],\n",
    "                departure_time: line[10],\n",
    "                departure_delay: line[11],\n",
    "                taxi_out: line[12],\n",
    "                wheels_off: line[13],\n",
    "                scheduled_time: line[14],\n",
    "                elapsed_time: line[15],\n",
    "                air_time: line[16],\n",
    "                distance: line[17],\n",
    "                wheels_on: line[18],\n",
    "                taxi_in: line[19],\n",
    "                scheduled_arrival: line[20],\n",
    "                arrival_time: line[21],\n",
    "                arrival_delay: line[22],\n",
    "                diverted: line[23],\n",
    "                cancelled: line[24],\n",
    "                cancellation_reason: line[25],\n",
    "                air_system_delay: line[26],\n",
    "                security_delay: line[27],\n",
    "                airline_delay: line[28],\n",
    "                late_aircraft_delay: line[29],\n",
    "                weather_delay: line[30]\n",
    "            }})\n",
    "            CREATE (:Tail {{\n",
    "                number: line[6]\n",
    "            }})\n",
    "            \"\"\"\n",
    "}\n",
    "\n",
    "for query in init_queries.items():\n",
    "    NeoQuery(query[1]).query(0)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "init_queries = {\n",
    "    'drop_all_tables': \"\"\"\n",
    "        DROP SCHEMA public CASCADE;\n",
    "        CREATE SCHEMA public;\n",
    "        \n",
    "        GRANT ALL ON SCHEMA public TO postgres;\n",
    "        GRANT ALL ON SCHEMA public TO public;\n",
    "        \"\"\",\n",
    "    'create_airlines_table': \"\"\"\n",
    "        CREATE TABLE IF NOT EXISTS airlines (\n",
    "          iata text,\n",
    "          name text);\n",
    "        \"\"\",\n",
    "    'create_airports_table': \"\"\"\n",
    "        CREATE TABLE IF NOT EXISTS airports (\n",
    "          iata text,\n",
    "          name text,\n",
    "          city text,\n",
    "          state text,\n",
    "          country text,\n",
    "          latitude text,\n",
    "          longitude text\n",
    "          );\n",
    "        \"\"\",\n",
    "    'create_flights_table': \"\"\"\n",
    "        CREATE TABLE IF NOT EXISTS flights (\n",
    "            year text,\n",
    "            month text,\n",
    "            day text,\n",
    "            day_of_week text,\n",
    "            airline text,\n",
    "            flight_number text,\n",
    "            tail_number text,\n",
    "            origin_airport text,\n",
    "            destination_airport text,\n",
    "            scheduled_departure text,\n",
    "            departure_time text,\n",
    "            departure_delay text,\n",
    "            taxi_out text,\n",
    "            wheels_off text,\n",
    "            scheduled_time text,\n",
    "            elapsed_time text,\n",
    "            air_time text,\n",
    "            distance text,\n",
    "            wheels_on text,\n",
    "            taxi_in text,\n",
    "            scheduled_arrival text,\n",
    "            arrival_time text,\n",
    "            arrival_delay text,\n",
    "            diverted text,\n",
    "            cancelled text,\n",
    "            cancellation_reason text,\n",
    "            air_system_delay text,\n",
    "            security_delay text,\n",
    "            airline_delay text,\n",
    "            late_aircraft_delay text,\n",
    "            weather_delay text\n",
    "        );\n",
    "        \"\"\",\n",
    "    'load_airlines_csv': f\"\"\"\n",
    "        COPY airlines\n",
    "        FROM '{current_path}/csv/airlines.csv' DELIMITER ',' HEADER CSV;\n",
    "        \"\"\",\n",
    "    'load_airports_csv': f\"\"\"\n",
    "        COPY airports\n",
    "        FROM '{current_path}/csv/airports.csv' DELIMITER ',' HEADER CSV;\n",
    "        \"\"\",\n",
    "    'load_flights_csv': f\"\"\"\n",
    "        COPY flights\n",
    "        FROM PROGRAM 'head -{LINE_LIMIT+1} {current_path}/csv/flights.csv' DELIMITER ',' HEADER CSV;\n",
    "        \"\"\"\n",
    "}\n",
    "\n",
    "for query in init_queries.items():\n",
    "    PostgresQuery(query[1]).query(0)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Match queries\n",
    "Create the relationships that will allow Neo4j to perform its best."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "match_queries = {\n",
    "    'match_origin_airport': \"\"\"\n",
    "            MATCH (fl:Flight),(ap:Airport)\n",
    "            WHERE fl.origin_airport = ap.iata\n",
    "            CREATE (ap)-[r:HAS_DEPARTURE]->(fl)\n",
    "            \"\"\",\n",
    "    'match_destination_airport': \"\"\"\n",
    "            MATCH (fl:Flight),(ap:Airport)\n",
    "            WHERE fl.destination_airport = ap.iata\n",
    "            CREATE (fl)-[:FLIES_TO]->(ap)\n",
    "            \"\"\",\n",
    "    'match_airline': \"\"\"\n",
    "            MATCH (fl:Flight),(al:Airline)\n",
    "            WHERE fl.airline = al.iata\n",
    "            CREATE (fl)-[:OPERATED_BY]->(al)\n",
    "            \"\"\",\n",
    "    'match_tail': \"\"\"\n",
    "            MATCH (fl:Flight),(tl:Tail)\n",
    "            WHERE fl.tail_number = tl.number\n",
    "            CREATE (fl)-[:USES]->(tl)\n",
    "            \"\"\"\n",
    "}\n",
    "\n",
    "for query in match_queries.items():\n",
    "    NeoQuery(query[1]).query(0)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Single table queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5.634307604\n",
      "1.9107843630000012\n",
      "['602', '1500', '409', '1167', '5498', '1012', '224', '977', '1256', '654']\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# all flights out of ORD\n",
    "\n",
    "nresults, ntime = NeoQuery(\n",
    "    \"\"\"\n",
    "    MATCH (fl:Flight {origin_airport: 'ORD'})\n",
    "    RETURN fl.flight_number\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "presults, ptime = PostgresQuery(\n",
    "    \"\"\"\n",
    "    SELECT flight_number from flights where origin_airport = 'ORD'\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "#time and results\n",
    "\n",
    "print(ntime)\n",
    "nresults = [record[0] for record in nresults]\n",
    "\n",
    "print(ptime)\n",
    "presults = [record[0] for record in presults]\n",
    "\n",
    "print(nresults[:10])\n",
    "\n",
    "list(set(presults) - set(nresults))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "7.532860826\n",
      "2.8979718340000034\n",
      "['1057', '824', '5976', '5547', '247', '1205', '943', '6420', '1492', '1966']\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# all flights with a delay of more than 100 minutes\n",
    "\n",
    "nresults, ntime = NeoQuery(\n",
    "    \"\"\"\n",
    "    MATCH (fl:Flight)\n",
    "    WHERE toInteger(fl.departure_delay) > 100\n",
    "    RETURN DISTINCT fl.flight_number\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "presults, ptime = PostgresQuery(\n",
    "    \"\"\"\n",
    "    SELECT flight_number from flights WHERE CAST (departure_delay AS INTEGER) > 100\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "print(ntime)\n",
    "nresults = [record[0] for record in nresults]\n",
    "\n",
    "print(ptime)\n",
    "presults = [record[0] for record in presults]\n",
    "\n",
    "print(nresults[:10])\n",
    "\n",
    "list(set(presults) - set(nresults))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Using Relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0.5024338879999988\n",
      "2.473501497000001\n",
      "['1441', '1744', '1808', '658', '1076', '2133', '1808', '1805', '461', '1095']\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# flights departing from Atlanta and arriving in Charlotte\n",
    "\n",
    "nresults, ntime = NeoQuery(\n",
    "    \"\"\"\n",
    "    MATCH (atl:Airport {iata: 'ATL'})-[:HAS_DEPARTURE]->(fl:Flight)-[:FLIES_TO]->(clt:Airport {iata: 'CLT'})\n",
    "    RETURN fl.flight_number\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "presults, ptime = PostgresQuery(\n",
    "    \"\"\"\n",
    "    SELECT flight_number from flights WHERE origin_airport = 'ATL' AND destination_airport = 'CLT'\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "print(ntime)\n",
    "nresults = [record[0] for record in nresults]\n",
    "\n",
    "print(ptime)\n",
    "presults = [record[0] for record in presults]\n",
    "\n",
    "print(nresults[:10])\n",
    "\n",
    "list(set(presults) - set(nresults))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1.7514138990000063\n",
      "3.337709685\n",
      "['1665', '1037', '1037', '661', '1058', '1004', '1256', '1591', '865', '1168']\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# flights departing from Chicago and arriving in Los Angeles operated by United\n",
    "\n",
    "nresults, ntime = NeoQuery(\n",
    "    \"\"\"\n",
    "    MATCH (ord:Airport {iata: 'ORD'})-[:HAS_DEPARTURE]->(fl:Flight)-[:FLIES_TO]->(lax:Airport {iata: 'LAX'}),\n",
    "          (fl)-[:OPERATED_BY]->(ua:Airline {iata: 'UA'})\n",
    "    RETURN fl.flight_number\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "presults, ptime = PostgresQuery(\n",
    "    \"\"\"\n",
    "    SELECT flight_number from flights WHERE origin_airport = 'ORD' AND destination_airport = 'LAX' AND airline = 'UA'\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "print(ntime)\n",
    "nresults = [record[0] for record in nresults]\n",
    "\n",
    "print(ptime)\n",
    "presults = [record[0] for record in presults]\n",
    "\n",
    "print(nresults[:10])\n",
    "\n",
    "list(set(presults) - set(nresults))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1.521279333999999\n",
      "1.9467545789999932\n",
      "['1058']\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# flights departing from Chicago and arriving in Los Angeles operated by United with Tail Number N33209\n",
    "\n",
    "nresults, ntime = NeoQuery(\n",
    "    \"\"\"\n",
    "    MATCH (ord:Airport {iata: 'ORD'})-[:HAS_DEPARTURE]->(fl:Flight)-[:FLIES_TO]->(lax:Airport {iata: 'LAX'}),\n",
    "          (fl)-[:OPERATED_BY]->(ua:Airline {iata: 'UA'}),\n",
    "          (fl)-[:USES]->(tl:Tail {number: 'N33209'})\n",
    "    RETURN DISTINCT fl.flight_number\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "presults, ptime = PostgresQuery(\n",
    "    \"\"\"\n",
    "    SELECT flight_number from flights WHERE origin_airport = 'ORD' AND destination_airport = 'LAX'\n",
    "    AND airline = 'UA' AND tail_number = 'N33209'\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "print(ntime)\n",
    "nresults = [record[0] for record in nresults]\n",
    "\n",
    "print(ptime)\n",
    "presults = [record[0] for record in presults]\n",
    "\n",
    "print(nresults[:10])\n",
    "\n",
    "list(set(presults) - set(nresults))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Joining across tables"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1.2315577379999993\n",
      "1.9353774920000006\n",
      "['American Airlines Inc.', 'Spirit Air Lines', 'United Air Lines Inc.', 'Virgin America']\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# get names of the airlines operating flights from Chicago to Los Angeles\n",
    "\n",
    "nresults, ntime = NeoQuery(\n",
    "    \"\"\"\n",
    "    MATCH (ord:Airport {iata: 'ORD'})-[:HAS_DEPARTURE]->(fl:Flight)-[:FLIES_TO]->(lax:Airport {iata: 'LAX'}),\n",
    "          (fl)-[:OPERATED_BY]->(al:Airline)\n",
    "    RETURN DISTINCT al.name\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "presults, ptime = PostgresQuery(\n",
    "    \"\"\"\n",
    "    SELECT name from airlines INNER JOIN flights ON (airlines.iata = flights.airline)\n",
    "    WHERE origin_airport = 'ORD' AND destination_airport = 'LAX'\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "print(ntime)\n",
    "nresults = [record[0] for record in nresults]\n",
    "\n",
    "print(ptime)\n",
    "presults = [record[0] for record in presults]\n",
    "\n",
    "print(nresults[:10])\n",
    "\n",
    "list(set(presults) - set(nresults))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0.3371646319999968\n",
      "3.141857969\n",
      "['San Francisco International Airport', 'Rock Springs-Sweetwater County Airport', 'Gillette-Campbell County Airport', 'Salt Lake City International Airport', \"Chicago O'Hare International Airport\", 'Los Angeles International Airport', 'Dallas/Fort Worth International Airport', 'Minneapolis-Saint Paul International Airport', 'Hartsfield-Jackson Atlanta International Airport', 'Newark Liberty International Airport']\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# get the names of destination airports from all flights originating in Wyoming\n",
    "\n",
    "nresults, ntime = NeoQuery(\n",
    "    \"\"\"\n",
    "    MATCH (hi:Airport {state: 'WY'})-[:HAS_DEPARTURE]->(fl:Flight)-[:FLIES_TO]->(ap:Airport)\n",
    "    RETURN DISTINCT ap.name\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "presults, ptime = PostgresQuery(\n",
    "    \"\"\"\n",
    "    SELECT name from airports\n",
    "    JOIN flights ON (airports.iata = flights.destination_airport)\n",
    "    WHERE flights.origin_airport IN (SELECT iata from airports WHERE airports.state = 'WY')\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "print(ntime)\n",
    "nresults = [record[0] for record in nresults]\n",
    "\n",
    "print(ptime)\n",
    "presults = [record[0] for record in presults]\n",
    "\n",
    "print(nresults[:10])\n",
    "\n",
    "list((set(presults) - set(nresults)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "12.269948760000005\n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1045.\n",
      "    Arrival at 1255 in Dallas/Fort Worth International Airport\n",
      "    90 minutes layover time.\n",
      "    Next leg departs at 1425 and lands at 1805 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1045.\n",
      "    Arrival at 1255 in Dallas/Fort Worth International Airport\n",
      "    95 minutes layover time.\n",
      "    Next leg departs at 1430 and lands at 1745 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1045.\n",
      "    Arrival at 1255 in Dallas/Fort Worth International Airport\n",
      "    80 minutes layover time.\n",
      "    Next leg departs at 1415 and lands at 1740 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1050.\n",
      "    Arrival at 1245 in Chicago Midway International Airport\n",
      "    90 minutes layover time.\n",
      "    Next leg departs at 1415 and lands at 1810 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1050.\n",
      "    Arrival at 1245 in Chicago Midway International Airport\n",
      "    75 minutes layover time.\n",
      "    Next leg departs at 1400 and lands at 1710 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1050.\n",
      "    Arrival at 1245 in Chicago Midway International Airport\n",
      "    75 minutes layover time.\n",
      "    Next leg departs at 1400 and lands at 1745 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1050.\n",
      "    Arrival at 1245 in Chicago Midway International Airport\n",
      "    105 minutes layover time.\n",
      "    Next leg departs at 1430 and lands at 1800 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1129.\n",
      "    Arrival at 1431 in Detroit Metropolitan Airport\n",
      "    83 minutes layover time.\n",
      "    Next leg departs at 1554 and lands at 1851 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1129.\n",
      "    Arrival at 1431 in Detroit Metropolitan Airport\n",
      "    69 minutes layover time.\n",
      "    Next leg departs at 1540 and lands at 1826 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1129.\n",
      "    Arrival at 1431 in Detroit Metropolitan Airport\n",
      "    88 minutes layover time.\n",
      "    Next leg departs at 1559 and lands at 1841 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1700.\n",
      "    Arrival at 1901 in Hartsfield-Jackson Atlanta International Airport\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 2051 and lands at 2209 in Daytona Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1700.\n",
      "    Arrival at 1901 in Hartsfield-Jackson Atlanta International Airport\n",
      "    104 minutes layover time.\n",
      "    Next leg departs at 2045 and lands at 2235 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1700.\n",
      "    Arrival at 1901 in Hartsfield-Jackson Atlanta International Airport\n",
      "    79 minutes layover time.\n",
      "    Next leg departs at 2020 and lands at 2215 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1700.\n",
      "    Arrival at 1901 in Hartsfield-Jackson Atlanta International Airport\n",
      "    113 minutes layover time.\n",
      "    Next leg departs at 2054 and lands at 2204 in Gainesville Regional Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1700.\n",
      "    Arrival at 1901 in Hartsfield-Jackson Atlanta International Airport\n",
      "    104 minutes layover time.\n",
      "    Next leg departs at 2045 and lands at 2153 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1700.\n",
      "    Arrival at 1901 in Hartsfield-Jackson Atlanta International Airport\n",
      "    114 minutes layover time.\n",
      "    Next leg departs at 2055 and lands at 2224 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1700.\n",
      "    Arrival at 1901 in Hartsfield-Jackson Atlanta International Airport\n",
      "    119 minutes layover time.\n",
      "    Next leg departs at 2100 and lands at 2249 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1700.\n",
      "    Arrival at 1901 in Hartsfield-Jackson Atlanta International Airport\n",
      "    100 minutes layover time.\n",
      "    Next leg departs at 2041 and lands at 2204 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0854 in Hartsfield-Jackson Atlanta International Airport\n",
      "    116 minutes layover time.\n",
      "    Next leg departs at 1050 and lands at 1102 in Northwest Florida Beaches International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0854 in Hartsfield-Jackson Atlanta International Airport\n",
      "    66 minutes layover time.\n",
      "    Next leg departs at 1000 and lands at 1200 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0854 in Hartsfield-Jackson Atlanta International Airport\n",
      "    81 minutes layover time.\n",
      "    Next leg departs at 1015 and lands at 1213 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0854 in Hartsfield-Jackson Atlanta International Airport\n",
      "    61 minutes layover time.\n",
      "    Next leg departs at 0955 and lands at 1102 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0854 in Hartsfield-Jackson Atlanta International Airport\n",
      "    61 minutes layover time.\n",
      "    Next leg departs at 0955 and lands at 1130 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0854 in Hartsfield-Jackson Atlanta International Airport\n",
      "    66 minutes layover time.\n",
      "    Next leg departs at 1000 and lands at 1202 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0854 in Hartsfield-Jackson Atlanta International Airport\n",
      "    96 minutes layover time.\n",
      "    Next leg departs at 1030 and lands at 1220 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0854 in Hartsfield-Jackson Atlanta International Airport\n",
      "    96 minutes layover time.\n",
      "    Next leg departs at 1030 and lands at 1206 in Sarasota-Bradenton International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0854 in Hartsfield-Jackson Atlanta International Airport\n",
      "    101 minutes layover time.\n",
      "    Next leg departs at 1035 and lands at 1203 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1625.\n",
      "    Arrival at 1820 in Dallas Love Field\n",
      "    85 minutes layover time.\n",
      "    Next leg departs at 1945 and lands at 2310 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1625.\n",
      "    Arrival at 1820 in Dallas Love Field\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 2010 and lands at 2325 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0900 in Dallas/Fort Worth International Airport\n",
      "    80 minutes layover time.\n",
      "    Next leg departs at 1020 and lands at 1400 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0900 in Dallas/Fort Worth International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 1055 and lands at 1435 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0900 in Dallas/Fort Worth International Airport\n",
      "    95 minutes layover time.\n",
      "    Next leg departs at 1035 and lands at 1213 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0900 in Dallas/Fort Worth International Airport\n",
      "    80 minutes layover time.\n",
      "    Next leg departs at 1020 and lands at 1348 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0900 in Dallas/Fort Worth International Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 1005 and lands at 1303 in Tallahassee International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0900 in Dallas/Fort Worth International Airport\n",
      "    94 minutes layover time.\n",
      "    Next leg departs at 1034 and lands at 1356 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0900 in Dallas/Fort Worth International Airport\n",
      "    80 minutes layover time.\n",
      "    Next leg departs at 1020 and lands at 1335 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0645.\n",
      "    Arrival at 0900 in Dallas/Fort Worth International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 1055 and lands at 1243 in Destin-Fort Walton Beach Airport/Eglin AFB\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1500.\n",
      "    Arrival at 1710 in Chicago O'Hare International Airport\n",
      "    113 minutes layover time.\n",
      "    Next leg departs at 1903 and lands at 2312 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1500.\n",
      "    Arrival at 1710 in Chicago O'Hare International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 1905 and lands at 2308 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1500.\n",
      "    Arrival at 1710 in Chicago O'Hare International Airport\n",
      "    83 minutes layover time.\n",
      "    Next leg departs at 1833 and lands at 2242 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1500.\n",
      "    Arrival at 1710 in Chicago O'Hare International Airport\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 1900 and lands at 2250 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1500.\n",
      "    Arrival at 1710 in Chicago O'Hare International Airport\n",
      "    95 minutes layover time.\n",
      "    Next leg departs at 1845 and lands at 2230 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1500.\n",
      "    Arrival at 1710 in Chicago O'Hare International Airport\n",
      "    61 minutes layover time.\n",
      "    Next leg departs at 1811 and lands at 2154 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0900.\n",
      "    Arrival at 1100 in Hartsfield-Jackson Atlanta International Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 1205 and lands at 1322 in Daytona Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0900.\n",
      "    Arrival at 1100 in Hartsfield-Jackson Atlanta International Airport\n",
      "    74 minutes layover time.\n",
      "    Next leg departs at 1214 and lands at 1326 in Gainesville Regional Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0900.\n",
      "    Arrival at 1100 in Hartsfield-Jackson Atlanta International Airport\n",
      "    85 minutes layover time.\n",
      "    Next leg departs at 1225 and lands at 1350 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0900.\n",
      "    Arrival at 1100 in Hartsfield-Jackson Atlanta International Airport\n",
      "    72 minutes layover time.\n",
      "    Next leg departs at 1212 and lands at 1343 in Melbourne International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0900.\n",
      "    Arrival at 1100 in Hartsfield-Jackson Atlanta International Airport\n",
      "    80 minutes layover time.\n",
      "    Next leg departs at 1220 and lands at 1410 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0900.\n",
      "    Arrival at 1100 in Hartsfield-Jackson Atlanta International Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 1205 and lands at 1347 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0900.\n",
      "    Arrival at 1100 in Hartsfield-Jackson Atlanta International Airport\n",
      "    100 minutes layover time.\n",
      "    Next leg departs at 1240 and lands at 1405 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0900.\n",
      "    Arrival at 1100 in Hartsfield-Jackson Atlanta International Airport\n",
      "    90 minutes layover time.\n",
      "    Next leg departs at 1230 and lands at 1244 in Destin-Fort Walton Beach Airport/Eglin AFB\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1440.\n",
      "    Arrival at 1636 in George Bush Intercontinental Airport\n",
      "    78 minutes layover time.\n",
      "    Next leg departs at 1754 and lands at 2105 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1145.\n",
      "    Arrival at 1335 in Dallas Love Field\n",
      "    70 minutes layover time.\n",
      "    Next leg departs at 1445 and lands at 1820 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0850.\n",
      "    Arrival at 1145 in Baltimore-Washington International Airport\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 1335 and lands at 1610 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0850.\n",
      "    Arrival at 1145 in Baltimore-Washington International Airport\n",
      "    84 minutes layover time.\n",
      "    Next leg departs at 1309 and lands at 1550 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0850.\n",
      "    Arrival at 1145 in Baltimore-Washington International Airport\n",
      "    95 minutes layover time.\n",
      "    Next leg departs at 1320 and lands at 1550 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0850.\n",
      "    Arrival at 1145 in Baltimore-Washington International Airport\n",
      "    105 minutes layover time.\n",
      "    Next leg departs at 1330 and lands at 1610 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1103.\n",
      "    Arrival at 1305 in Hartsfield-Jackson Atlanta International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 1500 and lands at 1655 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1103.\n",
      "    Arrival at 1305 in Hartsfield-Jackson Atlanta International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 1500 and lands at 1615 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1103.\n",
      "    Arrival at 1305 in Hartsfield-Jackson Atlanta International Airport\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 1455 and lands at 1624 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1103.\n",
      "    Arrival at 1305 in Hartsfield-Jackson Atlanta International Airport\n",
      "    118 minutes layover time.\n",
      "    Next leg departs at 1503 and lands at 1521 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1103.\n",
      "    Arrival at 1305 in Hartsfield-Jackson Atlanta International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 1500 and lands at 1635 in Sarasota-Bradenton International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1103.\n",
      "    Arrival at 1305 in Hartsfield-Jackson Atlanta International Airport\n",
      "    90 minutes layover time.\n",
      "    Next leg departs at 1435 and lands at 1600 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0840.\n",
      "    Arrival at 1032 in George Bush Intercontinental Airport\n",
      "    95 minutes layover time.\n",
      "    Next leg departs at 1207 and lands at 1518 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 0840.\n",
      "    Arrival at 1032 in George Bush Intercontinental Airport\n",
      "    118 minutes layover time.\n",
      "    Next leg departs at 1230 and lands at 1555 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1532.\n",
      "    Arrival at 1747 in Denver International Airport\n",
      "    73 minutes layover time.\n",
      "    Next leg departs at 1900 and lands at 0030 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1710.\n",
      "    Arrival at 1920 in Dallas/Fort Worth International Airport\n",
      "    80 minutes layover time.\n",
      "    Next leg departs at 2040 and lands at 0015 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1710.\n",
      "    Arrival at 1920 in Dallas/Fort Worth International Airport\n",
      "    75 minutes layover time.\n",
      "    Next leg departs at 2035 and lands at 0011 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1710.\n",
      "    Arrival at 1920 in Dallas/Fort Worth International Airport\n",
      "    75 minutes layover time.\n",
      "    Next leg departs at 2035 and lands at 0005 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1710.\n",
      "    Arrival at 1920 in Dallas/Fort Worth International Airport\n",
      "    70 minutes layover time.\n",
      "    Next leg departs at 2030 and lands at 2355 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Birmingham-Shuttlesworth International Airport at 1710.\n",
      "    Arrival at 1920 in Dallas/Fort Worth International Airport\n",
      "    80 minutes layover time.\n",
      "    Next leg departs at 2040 and lands at 2355 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1051.\n",
      "    Arrival at 1248 in Hartsfield-Jackson Atlanta International Airport\n",
      "    67 minutes layover time.\n",
      "    Next leg departs at 1355 and lands at 1525 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1051.\n",
      "    Arrival at 1248 in Hartsfield-Jackson Atlanta International Airport\n",
      "    62 minutes layover time.\n",
      "    Next leg departs at 1350 and lands at 1520 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1051.\n",
      "    Arrival at 1248 in Hartsfield-Jackson Atlanta International Airport\n",
      "    62 minutes layover time.\n",
      "    Next leg departs at 1350 and lands at 1549 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1051.\n",
      "    Arrival at 1248 in Hartsfield-Jackson Atlanta International Airport\n",
      "    69 minutes layover time.\n",
      "    Next leg departs at 1357 and lands at 1549 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1051.\n",
      "    Arrival at 1248 in Hartsfield-Jackson Atlanta International Airport\n",
      "    67 minutes layover time.\n",
      "    Next leg departs at 1355 and lands at 1541 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1051.\n",
      "    Arrival at 1248 in Hartsfield-Jackson Atlanta International Airport\n",
      "    67 minutes layover time.\n",
      "    Next leg departs at 1355 and lands at 1501 in Tallahassee International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1051.\n",
      "    Arrival at 1248 in Hartsfield-Jackson Atlanta International Airport\n",
      "    107 minutes layover time.\n",
      "    Next leg departs at 1435 and lands at 1600 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1412.\n",
      "    Arrival at 1609 in Hartsfield-Jackson Atlanta International Airport\n",
      "    66 minutes layover time.\n",
      "    Next leg departs at 1715 and lands at 1905 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1412.\n",
      "    Arrival at 1609 in Hartsfield-Jackson Atlanta International Airport\n",
      "    96 minutes layover time.\n",
      "    Next leg departs at 1745 and lands at 1852 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1412.\n",
      "    Arrival at 1609 in Hartsfield-Jackson Atlanta International Airport\n",
      "    116 minutes layover time.\n",
      "    Next leg departs at 1805 and lands at 1915 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1412.\n",
      "    Arrival at 1609 in Hartsfield-Jackson Atlanta International Airport\n",
      "    106 minutes layover time.\n",
      "    Next leg departs at 1755 and lands at 1925 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1412.\n",
      "    Arrival at 1609 in Hartsfield-Jackson Atlanta International Airport\n",
      "    66 minutes layover time.\n",
      "    Next leg departs at 1715 and lands at 1840 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1412.\n",
      "    Arrival at 1609 in Hartsfield-Jackson Atlanta International Airport\n",
      "    101 minutes layover time.\n",
      "    Next leg departs at 1750 and lands at 1948 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1412.\n",
      "    Arrival at 1609 in Hartsfield-Jackson Atlanta International Airport\n",
      "    86 minutes layover time.\n",
      "    Next leg departs at 1735 and lands at 1925 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1412.\n",
      "    Arrival at 1609 in Hartsfield-Jackson Atlanta International Airport\n",
      "    89 minutes layover time.\n",
      "    Next leg departs at 1738 and lands at 1751 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1412.\n",
      "    Arrival at 1609 in Hartsfield-Jackson Atlanta International Airport\n",
      "    76 minutes layover time.\n",
      "    Next leg departs at 1725 and lands at 1850 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Dothan Regional Airport at 1412.\n",
      "    Arrival at 1609 in Hartsfield-Jackson Atlanta International Airport\n",
      "    116 minutes layover time.\n",
      "    Next leg departs at 1805 and lands at 1930 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0655.\n",
      "    Arrival at 0905 in Chicago O'Hare International Airport\n",
      "    75 minutes layover time.\n",
      "    Next leg departs at 1020 and lands at 1343 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0655.\n",
      "    Arrival at 0905 in Chicago O'Hare International Airport\n",
      "    93 minutes layover time.\n",
      "    Next leg departs at 1038 and lands at 1415 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0655.\n",
      "    Arrival at 0905 in Chicago O'Hare International Airport\n",
      "    105 minutes layover time.\n",
      "    Next leg departs at 1050 and lands at 1420 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0655.\n",
      "    Arrival at 0905 in Chicago O'Hare International Airport\n",
      "    108 minutes layover time.\n",
      "    Next leg departs at 1053 and lands at 1435 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0655.\n",
      "    Arrival at 0905 in Chicago O'Hare International Airport\n",
      "    102 minutes layover time.\n",
      "    Next leg departs at 1047 and lands at 1429 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0655.\n",
      "    Arrival at 0905 in Chicago O'Hare International Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 1010 and lands at 1400 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0655.\n",
      "    Arrival at 0905 in Chicago O'Hare International Airport\n",
      "    90 minutes layover time.\n",
      "    Next leg departs at 1035 and lands at 1415 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1300.\n",
      "    Arrival at 1505 in Dallas/Fort Worth International Airport\n",
      "    96 minutes layover time.\n",
      "    Next leg departs at 1641 and lands at 2025 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1300.\n",
      "    Arrival at 1505 in Dallas/Fort Worth International Airport\n",
      "    105 minutes layover time.\n",
      "    Next leg departs at 1650 and lands at 1828 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1300.\n",
      "    Arrival at 1505 in Dallas/Fort Worth International Airport\n",
      "    70 minutes layover time.\n",
      "    Next leg departs at 1615 and lands at 1803 in Destin-Fort Walton Beach Airport/Eglin AFB\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1635.\n",
      "    Arrival at 1845 in Dallas/Fort Worth International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 2040 and lands at 0015 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1635.\n",
      "    Arrival at 1845 in Dallas/Fort Worth International Airport\n",
      "    90 minutes layover time.\n",
      "    Next leg departs at 2015 and lands at 2335 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1635.\n",
      "    Arrival at 1845 in Dallas/Fort Worth International Airport\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 2035 and lands at 0011 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1635.\n",
      "    Arrival at 1845 in Dallas/Fort Worth International Airport\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 2035 and lands at 0005 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1635.\n",
      "    Arrival at 1845 in Dallas/Fort Worth International Airport\n",
      "    105 minutes layover time.\n",
      "    Next leg departs at 2030 and lands at 2355 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1635.\n",
      "    Arrival at 1845 in Dallas/Fort Worth International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 2040 and lands at 2355 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1635.\n",
      "    Arrival at 1845 in Dallas/Fort Worth International Airport\n",
      "    85 minutes layover time.\n",
      "    Next leg departs at 2010 and lands at 2158 in Destin-Fort Walton Beach Airport/Eglin AFB\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1025.\n",
      "    Arrival at 1235 in Dallas/Fort Worth International Airport\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 1425 and lands at 1805 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1025.\n",
      "    Arrival at 1235 in Dallas/Fort Worth International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 1430 and lands at 1745 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1025.\n",
      "    Arrival at 1235 in Dallas/Fort Worth International Airport\n",
      "    100 minutes layover time.\n",
      "    Next leg departs at 1415 and lands at 1740 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1025.\n",
      "    Arrival at 1235 in Dallas/Fort Worth International Airport\n",
      "    77 minutes layover time.\n",
      "    Next leg departs at 1352 and lands at 1735 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1025.\n",
      "    Arrival at 1235 in Dallas/Fort Worth International Airport\n",
      "    70 minutes layover time.\n",
      "    Next leg departs at 1345 and lands at 1528 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1025.\n",
      "    Arrival at 1235 in Dallas/Fort Worth International Airport\n",
      "    80 minutes layover time.\n",
      "    Next leg departs at 1355 and lands at 1720 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1402.\n",
      "    Arrival at 1550 in Chicago O'Hare International Airport\n",
      "    100 minutes layover time.\n",
      "    Next leg departs at 1730 and lands at 2136 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1402.\n",
      "    Arrival at 1550 in Chicago O'Hare International Airport\n",
      "    91 minutes layover time.\n",
      "    Next leg departs at 1721 and lands at 2112 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    112 minutes layover time.\n",
      "    Next leg departs at 1050 and lands at 1102 in Northwest Florida Beaches International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    62 minutes layover time.\n",
      "    Next leg departs at 1000 and lands at 1200 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    77 minutes layover time.\n",
      "    Next leg departs at 1015 and lands at 1213 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    117 minutes layover time.\n",
      "    Next leg departs at 1055 and lands at 1209 in Gainesville Regional Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    117 minutes layover time.\n",
      "    Next leg departs at 1055 and lands at 1230 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    62 minutes layover time.\n",
      "    Next leg departs at 1000 and lands at 1202 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    92 minutes layover time.\n",
      "    Next leg departs at 1030 and lands at 1220 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    119 minutes layover time.\n",
      "    Next leg departs at 1057 and lands at 1120 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    116 minutes layover time.\n",
      "    Next leg departs at 1054 and lands at 1242 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    92 minutes layover time.\n",
      "    Next leg departs at 1030 and lands at 1206 in Sarasota-Bradenton International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 0650.\n",
      "    Arrival at 0858 in Hartsfield-Jackson Atlanta International Airport\n",
      "    97 minutes layover time.\n",
      "    Next leg departs at 1035 and lands at 1203 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1045.\n",
      "    Arrival at 1243 in Hartsfield-Jackson Atlanta International Airport\n",
      "    62 minutes layover time.\n",
      "    Next leg departs at 1345 and lands at 1539 in Key West International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1045.\n",
      "    Arrival at 1243 in Hartsfield-Jackson Atlanta International Airport\n",
      "    72 minutes layover time.\n",
      "    Next leg departs at 1355 and lands at 1525 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1045.\n",
      "    Arrival at 1243 in Hartsfield-Jackson Atlanta International Airport\n",
      "    67 minutes layover time.\n",
      "    Next leg departs at 1350 and lands at 1520 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1045.\n",
      "    Arrival at 1243 in Hartsfield-Jackson Atlanta International Airport\n",
      "    67 minutes layover time.\n",
      "    Next leg departs at 1350 and lands at 1549 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1045.\n",
      "    Arrival at 1243 in Hartsfield-Jackson Atlanta International Airport\n",
      "    74 minutes layover time.\n",
      "    Next leg departs at 1357 and lands at 1549 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1045.\n",
      "    Arrival at 1243 in Hartsfield-Jackson Atlanta International Airport\n",
      "    63 minutes layover time.\n",
      "    Next leg departs at 1346 and lands at 1401 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1045.\n",
      "    Arrival at 1243 in Hartsfield-Jackson Atlanta International Airport\n",
      "    72 minutes layover time.\n",
      "    Next leg departs at 1355 and lands at 1541 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1045.\n",
      "    Arrival at 1243 in Hartsfield-Jackson Atlanta International Airport\n",
      "    72 minutes layover time.\n",
      "    Next leg departs at 1355 and lands at 1501 in Tallahassee International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1045.\n",
      "    Arrival at 1243 in Hartsfield-Jackson Atlanta International Airport\n",
      "    112 minutes layover time.\n",
      "    Next leg departs at 1435 and lands at 1600 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1431.\n",
      "    Arrival at 1624 in Hartsfield-Jackson Atlanta International Airport\n",
      "    81 minutes layover time.\n",
      "    Next leg departs at 1745 and lands at 1852 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1431.\n",
      "    Arrival at 1624 in Hartsfield-Jackson Atlanta International Airport\n",
      "    101 minutes layover time.\n",
      "    Next leg departs at 1805 and lands at 1915 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1431.\n",
      "    Arrival at 1624 in Hartsfield-Jackson Atlanta International Airport\n",
      "    91 minutes layover time.\n",
      "    Next leg departs at 1755 and lands at 1925 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1431.\n",
      "    Arrival at 1624 in Hartsfield-Jackson Atlanta International Airport\n",
      "    86 minutes layover time.\n",
      "    Next leg departs at 1750 and lands at 1948 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1431.\n",
      "    Arrival at 1624 in Hartsfield-Jackson Atlanta International Airport\n",
      "    71 minutes layover time.\n",
      "    Next leg departs at 1735 and lands at 1925 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1431.\n",
      "    Arrival at 1624 in Hartsfield-Jackson Atlanta International Airport\n",
      "    74 minutes layover time.\n",
      "    Next leg departs at 1738 and lands at 1751 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1431.\n",
      "    Arrival at 1624 in Hartsfield-Jackson Atlanta International Airport\n",
      "    61 minutes layover time.\n",
      "    Next leg departs at 1725 and lands at 1850 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1431.\n",
      "    Arrival at 1624 in Hartsfield-Jackson Atlanta International Airport\n",
      "    101 minutes layover time.\n",
      "    Next leg departs at 1805 and lands at 1930 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1431.\n",
      "    Arrival at 1624 in Hartsfield-Jackson Atlanta International Airport\n",
      "    106 minutes layover time.\n",
      "    Next leg departs at 1810 and lands at 1825 in Destin-Fort Walton Beach Airport/Eglin AFB\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1739.\n",
      "    Arrival at 1944 in Hartsfield-Jackson Atlanta International Airport\n",
      "    67 minutes layover time.\n",
      "    Next leg departs at 2051 and lands at 2209 in Daytona Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1739.\n",
      "    Arrival at 1944 in Hartsfield-Jackson Atlanta International Airport\n",
      "    61 minutes layover time.\n",
      "    Next leg departs at 2045 and lands at 2235 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1739.\n",
      "    Arrival at 1944 in Hartsfield-Jackson Atlanta International Airport\n",
      "    70 minutes layover time.\n",
      "    Next leg departs at 2054 and lands at 2204 in Gainesville Regional Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1739.\n",
      "    Arrival at 1944 in Hartsfield-Jackson Atlanta International Airport\n",
      "    61 minutes layover time.\n",
      "    Next leg departs at 2045 and lands at 2153 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1739.\n",
      "    Arrival at 1944 in Hartsfield-Jackson Atlanta International Airport\n",
      "    71 minutes layover time.\n",
      "    Next leg departs at 2055 and lands at 2224 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1739.\n",
      "    Arrival at 1944 in Hartsfield-Jackson Atlanta International Airport\n",
      "    106 minutes layover time.\n",
      "    Next leg departs at 2130 and lands at 2305 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1739.\n",
      "    Arrival at 1944 in Hartsfield-Jackson Atlanta International Airport\n",
      "    86 minutes layover time.\n",
      "    Next leg departs at 2110 and lands at 2302 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1739.\n",
      "    Arrival at 1944 in Hartsfield-Jackson Atlanta International Airport\n",
      "    78 minutes layover time.\n",
      "    Next leg departs at 2102 and lands at 2233 in Melbourne International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1739.\n",
      "    Arrival at 1944 in Hartsfield-Jackson Atlanta International Airport\n",
      "    76 minutes layover time.\n",
      "    Next leg departs at 2100 and lands at 2249 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1739.\n",
      "    Arrival at 1944 in Hartsfield-Jackson Atlanta International Airport\n",
      "    84 minutes layover time.\n",
      "    Next leg departs at 2108 and lands at 2215 in Tallahassee International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1238.\n",
      "    Arrival at 1440 in George Bush Intercontinental Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 1545 and lands at 1910 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1238.\n",
      "    Arrival at 1440 in George Bush Intercontinental Airport\n",
      "    76 minutes layover time.\n",
      "    Next leg departs at 1556 and lands at 1908 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Huntsville International Airport at 1238.\n",
      "    Arrival at 1440 in George Bush Intercontinental Airport\n",
      "    117 minutes layover time.\n",
      "    Next leg departs at 1637 and lands at 1804 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1105.\n",
      "    Arrival at 1310 in Dallas/Fort Worth International Airport\n",
      "    75 minutes layover time.\n",
      "    Next leg departs at 1425 and lands at 1805 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1105.\n",
      "    Arrival at 1310 in Dallas/Fort Worth International Airport\n",
      "    80 minutes layover time.\n",
      "    Next leg departs at 1430 and lands at 1745 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1105.\n",
      "    Arrival at 1310 in Dallas/Fort Worth International Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 1415 and lands at 1740 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1105.\n",
      "    Arrival at 1310 in Dallas/Fort Worth International Airport\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 1500 and lands at 1815 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1720.\n",
      "    Arrival at 1930 in Dallas/Fort Worth International Airport\n",
      "    70 minutes layover time.\n",
      "    Next leg departs at 2040 and lands at 0015 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1720.\n",
      "    Arrival at 1930 in Dallas/Fort Worth International Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 2035 and lands at 0011 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1720.\n",
      "    Arrival at 1930 in Dallas/Fort Worth International Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 2035 and lands at 0005 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1720.\n",
      "    Arrival at 1930 in Dallas/Fort Worth International Airport\n",
      "    70 minutes layover time.\n",
      "    Next leg departs at 2040 and lands at 2355 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    86 minutes layover time.\n",
      "    Next leg departs at 0932 and lands at 1051 in Daytona Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    69 minutes layover time.\n",
      "    Next leg departs at 0915 and lands at 0923 in Northwest Florida Beaches International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    99 minutes layover time.\n",
      "    Next leg departs at 0945 and lands at 1141 in Key West International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    64 minutes layover time.\n",
      "    Next leg departs at 0910 and lands at 1105 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    104 minutes layover time.\n",
      "    Next leg departs at 0950 and lands at 1150 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    114 minutes layover time.\n",
      "    Next leg departs at 1000 and lands at 1200 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    109 minutes layover time.\n",
      "    Next leg departs at 0955 and lands at 1102 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    109 minutes layover time.\n",
      "    Next leg departs at 0955 and lands at 1130 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    114 minutes layover time.\n",
      "    Next leg departs at 1000 and lands at 1202 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    86 minutes layover time.\n",
      "    Next leg departs at 0932 and lands at 1107 in Melbourne International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    67 minutes layover time.\n",
      "    Next leg departs at 0913 and lands at 1042 in Melbourne International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    105 minutes layover time.\n",
      "    Next leg departs at 0951 and lands at 1145 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    64 minutes layover time.\n",
      "    Next leg departs at 0910 and lands at 1055 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    74 minutes layover time.\n",
      "    Next leg departs at 0920 and lands at 1104 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    93 minutes layover time.\n",
      "    Next leg departs at 0939 and lands at 1123 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    69 minutes layover time.\n",
      "    Next leg departs at 0915 and lands at 1048 in Sarasota-Bradenton International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    79 minutes layover time.\n",
      "    Next leg departs at 0925 and lands at 1055 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    89 minutes layover time.\n",
      "    Next leg departs at 0935 and lands at 1103 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0615.\n",
      "    Arrival at 0806 in Hartsfield-Jackson Atlanta International Airport\n",
      "    104 minutes layover time.\n",
      "    Next leg departs at 0950 and lands at 1120 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1518.\n",
      "    Arrival at 1711 in Hartsfield-Jackson Atlanta International Airport\n",
      "    119 minutes layover time.\n",
      "    Next leg departs at 1910 and lands at 2100 in Key West International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1518.\n",
      "    Arrival at 1711 in Hartsfield-Jackson Atlanta International Airport\n",
      "    104 minutes layover time.\n",
      "    Next leg departs at 1855 and lands at 2050 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1518.\n",
      "    Arrival at 1711 in Hartsfield-Jackson Atlanta International Airport\n",
      "    79 minutes layover time.\n",
      "    Next leg departs at 1830 and lands at 2025 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1518.\n",
      "    Arrival at 1711 in Hartsfield-Jackson Atlanta International Airport\n",
      "    104 minutes layover time.\n",
      "    Next leg departs at 1855 and lands at 2027 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1518.\n",
      "    Arrival at 1711 in Hartsfield-Jackson Atlanta International Airport\n",
      "    119 minutes layover time.\n",
      "    Next leg departs at 1910 and lands at 2106 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1518.\n",
      "    Arrival at 1711 in Hartsfield-Jackson Atlanta International Airport\n",
      "    99 minutes layover time.\n",
      "    Next leg departs at 1850 and lands at 2045 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1358.\n",
      "    Arrival at 1551 in Hartsfield-Jackson Atlanta International Airport\n",
      "    69 minutes layover time.\n",
      "    Next leg departs at 1700 and lands at 1852 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1358.\n",
      "    Arrival at 1551 in Hartsfield-Jackson Atlanta International Airport\n",
      "    84 minutes layover time.\n",
      "    Next leg departs at 1715 and lands at 1905 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1358.\n",
      "    Arrival at 1551 in Hartsfield-Jackson Atlanta International Airport\n",
      "    114 minutes layover time.\n",
      "    Next leg departs at 1745 and lands at 1852 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1358.\n",
      "    Arrival at 1551 in Hartsfield-Jackson Atlanta International Airport\n",
      "    64 minutes layover time.\n",
      "    Next leg departs at 1655 and lands at 1821 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1358.\n",
      "    Arrival at 1551 in Hartsfield-Jackson Atlanta International Airport\n",
      "    84 minutes layover time.\n",
      "    Next leg departs at 1715 and lands at 1840 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1358.\n",
      "    Arrival at 1551 in Hartsfield-Jackson Atlanta International Airport\n",
      "    119 minutes layover time.\n",
      "    Next leg departs at 1750 and lands at 1948 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1358.\n",
      "    Arrival at 1551 in Hartsfield-Jackson Atlanta International Airport\n",
      "    104 minutes layover time.\n",
      "    Next leg departs at 1735 and lands at 1925 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1358.\n",
      "    Arrival at 1551 in Hartsfield-Jackson Atlanta International Airport\n",
      "    107 minutes layover time.\n",
      "    Next leg departs at 1738 and lands at 1751 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1358.\n",
      "    Arrival at 1551 in Hartsfield-Jackson Atlanta International Airport\n",
      "    69 minutes layover time.\n",
      "    Next leg departs at 1700 and lands at 1840 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 1358.\n",
      "    Arrival at 1551 in Hartsfield-Jackson Atlanta International Airport\n",
      "    94 minutes layover time.\n",
      "    Next leg departs at 1725 and lands at 1850 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0630.\n",
      "    Arrival at 0845 in Dallas/Fort Worth International Airport\n",
      "    95 minutes layover time.\n",
      "    Next leg departs at 1020 and lands at 1400 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0630.\n",
      "    Arrival at 0845 in Dallas/Fort Worth International Airport\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 1035 and lands at 1213 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0630.\n",
      "    Arrival at 0845 in Dallas/Fort Worth International Airport\n",
      "    95 minutes layover time.\n",
      "    Next leg departs at 1020 and lands at 1348 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0630.\n",
      "    Arrival at 0845 in Dallas/Fort Worth International Airport\n",
      "    80 minutes layover time.\n",
      "    Next leg departs at 1005 and lands at 1303 in Tallahassee International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0630.\n",
      "    Arrival at 0845 in Dallas/Fort Worth International Airport\n",
      "    109 minutes layover time.\n",
      "    Next leg departs at 1034 and lands at 1356 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0630.\n",
      "    Arrival at 0845 in Dallas/Fort Worth International Airport\n",
      "    95 minutes layover time.\n",
      "    Next leg departs at 1020 and lands at 1335 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0927.\n",
      "    Arrival at 1123 in Hartsfield-Jackson Atlanta International Airport\n",
      "    101 minutes layover time.\n",
      "    Next leg departs at 1304 and lands at 1310 in Northwest Florida Beaches International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0927.\n",
      "    Arrival at 1123 in Hartsfield-Jackson Atlanta International Airport\n",
      "    97 minutes layover time.\n",
      "    Next leg departs at 1300 and lands at 1452 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0927.\n",
      "    Arrival at 1123 in Hartsfield-Jackson Atlanta International Airport\n",
      "    102 minutes layover time.\n",
      "    Next leg departs at 1305 and lands at 1412 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0927.\n",
      "    Arrival at 1123 in Hartsfield-Jackson Atlanta International Airport\n",
      "    62 minutes layover time.\n",
      "    Next leg departs at 1225 and lands at 1350 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0927.\n",
      "    Arrival at 1123 in Hartsfield-Jackson Atlanta International Airport\n",
      "    77 minutes layover time.\n",
      "    Next leg departs at 1240 and lands at 1405 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Montgomery Regional Airport at 0927.\n",
      "    Arrival at 1123 in Hartsfield-Jackson Atlanta International Airport\n",
      "    67 minutes layover time.\n",
      "    Next leg departs at 1230 and lands at 1244 in Destin-Fort Walton Beach Airport/Eglin AFB\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1318.\n",
      "    Arrival at 1544 in Chicago O'Hare International Airport\n",
      "    106 minutes layover time.\n",
      "    Next leg departs at 1730 and lands at 2136 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1318.\n",
      "    Arrival at 1544 in Chicago O'Hare International Airport\n",
      "    97 minutes layover time.\n",
      "    Next leg departs at 1721 and lands at 2112 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0911.\n",
      "    Arrival at 1045 in George Bush Intercontinental Airport\n",
      "    82 minutes layover time.\n",
      "    Next leg departs at 1207 and lands at 1518 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0911.\n",
      "    Arrival at 1045 in George Bush Intercontinental Airport\n",
      "    105 minutes layover time.\n",
      "    Next leg departs at 1230 and lands at 1555 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1635.\n",
      "    Arrival at 1850 in Hartsfield-Jackson Atlanta International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 2045 and lands at 2235 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1635.\n",
      "    Arrival at 1850 in Hartsfield-Jackson Atlanta International Airport\n",
      "    90 minutes layover time.\n",
      "    Next leg departs at 2020 and lands at 2215 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1635.\n",
      "    Arrival at 1850 in Hartsfield-Jackson Atlanta International Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 1955 and lands at 2146 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1635.\n",
      "    Arrival at 1850 in Hartsfield-Jackson Atlanta International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 2045 and lands at 2153 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1635.\n",
      "    Arrival at 1850 in Hartsfield-Jackson Atlanta International Airport\n",
      "    70 minutes layover time.\n",
      "    Next leg departs at 2000 and lands at 2125 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1635.\n",
      "    Arrival at 1850 in Hartsfield-Jackson Atlanta International Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 1955 and lands at 2123 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1635.\n",
      "    Arrival at 1850 in Hartsfield-Jackson Atlanta International Airport\n",
      "    65 minutes layover time.\n",
      "    Next leg departs at 1955 and lands at 2146 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1635.\n",
      "    Arrival at 1850 in Hartsfield-Jackson Atlanta International Airport\n",
      "    61 minutes layover time.\n",
      "    Next leg departs at 1951 and lands at 2007 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1635.\n",
      "    Arrival at 1850 in Hartsfield-Jackson Atlanta International Airport\n",
      "    69 minutes layover time.\n",
      "    Next leg departs at 1959 and lands at 2140 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1635.\n",
      "    Arrival at 1850 in Hartsfield-Jackson Atlanta International Airport\n",
      "    111 minutes layover time.\n",
      "    Next leg departs at 2041 and lands at 2204 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0600.\n",
      "    Arrival at 0750 in Dallas/Fort Worth International Airport\n",
      "    100 minutes layover time.\n",
      "    Next leg departs at 0930 and lands at 1255 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0600.\n",
      "    Arrival at 0750 in Dallas/Fort Worth International Airport\n",
      "    85 minutes layover time.\n",
      "    Next leg departs at 0915 and lands at 1250 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0600.\n",
      "    Arrival at 0750 in Dallas/Fort Worth International Airport\n",
      "    95 minutes layover time.\n",
      "    Next leg departs at 0925 and lands at 1250 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    69 minutes layover time.\n",
      "    Next leg departs at 0932 and lands at 1051 in Daytona Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    82 minutes layover time.\n",
      "    Next leg departs at 0945 and lands at 1141 in Key West International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    87 minutes layover time.\n",
      "    Next leg departs at 0950 and lands at 1150 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    97 minutes layover time.\n",
      "    Next leg departs at 1000 and lands at 1200 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    112 minutes layover time.\n",
      "    Next leg departs at 1015 and lands at 1213 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    92 minutes layover time.\n",
      "    Next leg departs at 0955 and lands at 1102 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    92 minutes layover time.\n",
      "    Next leg departs at 0955 and lands at 1130 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    97 minutes layover time.\n",
      "    Next leg departs at 1000 and lands at 1202 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    69 minutes layover time.\n",
      "    Next leg departs at 0932 and lands at 1107 in Melbourne International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    88 minutes layover time.\n",
      "    Next leg departs at 0951 and lands at 1145 in Palm Beach International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    76 minutes layover time.\n",
      "    Next leg departs at 0939 and lands at 1123 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    62 minutes layover time.\n",
      "    Next leg departs at 0925 and lands at 1055 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    72 minutes layover time.\n",
      "    Next leg departs at 0935 and lands at 1103 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0615.\n",
      "    Arrival at 0823 in Hartsfield-Jackson Atlanta International Airport\n",
      "    87 minutes layover time.\n",
      "    Next leg departs at 0950 and lands at 1120 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0915.\n",
      "    Arrival at 1124 in Hartsfield-Jackson Atlanta International Airport\n",
      "    100 minutes layover time.\n",
      "    Next leg departs at 1304 and lands at 1310 in Northwest Florida Beaches International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0915.\n",
      "    Arrival at 1124 in Hartsfield-Jackson Atlanta International Airport\n",
      "    96 minutes layover time.\n",
      "    Next leg departs at 1300 and lands at 1452 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0915.\n",
      "    Arrival at 1124 in Hartsfield-Jackson Atlanta International Airport\n",
      "    101 minutes layover time.\n",
      "    Next leg departs at 1305 and lands at 1412 in Jacksonville International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0915.\n",
      "    Arrival at 1124 in Hartsfield-Jackson Atlanta International Airport\n",
      "    61 minutes layover time.\n",
      "    Next leg departs at 1225 and lands at 1350 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0915.\n",
      "    Arrival at 1124 in Hartsfield-Jackson Atlanta International Airport\n",
      "    76 minutes layover time.\n",
      "    Next leg departs at 1240 and lands at 1405 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0915.\n",
      "    Arrival at 1124 in Hartsfield-Jackson Atlanta International Airport\n",
      "    66 minutes layover time.\n",
      "    Next leg departs at 1230 and lands at 1244 in Destin-Fort Walton Beach Airport/Eglin AFB\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1300.\n",
      "    Arrival at 1512 in Hartsfield-Jackson Atlanta International Airport\n",
      "    98 minutes layover time.\n",
      "    Next leg departs at 1650 and lands at 1659 in Northwest Florida Beaches International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1300.\n",
      "    Arrival at 1512 in Hartsfield-Jackson Atlanta International Airport\n",
      "    108 minutes layover time.\n",
      "    Next leg departs at 1700 and lands at 1852 in Fort Lauderdale-Hollywood International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1300.\n",
      "    Arrival at 1512 in Hartsfield-Jackson Atlanta International Airport\n",
      "    88 minutes layover time.\n",
      "    Next leg departs at 1640 and lands at 1752 in Gainesville Regional Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1300.\n",
      "    Arrival at 1512 in Hartsfield-Jackson Atlanta International Airport\n",
      "    103 minutes layover time.\n",
      "    Next leg departs at 1655 and lands at 1821 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1300.\n",
      "    Arrival at 1512 in Hartsfield-Jackson Atlanta International Airport\n",
      "    68 minutes layover time.\n",
      "    Next leg departs at 1620 and lands at 1750 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1300.\n",
      "    Arrival at 1512 in Hartsfield-Jackson Atlanta International Airport\n",
      "    108 minutes layover time.\n",
      "    Next leg departs at 1700 and lands at 1840 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1300.\n",
      "    Arrival at 1512 in Hartsfield-Jackson Atlanta International Airport\n",
      "    73 minutes layover time.\n",
      "    Next leg departs at 1625 and lands at 1809 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1300.\n",
      "    Arrival at 1512 in Hartsfield-Jackson Atlanta International Airport\n",
      "    83 minutes layover time.\n",
      "    Next leg departs at 1635 and lands at 1803 in Tampa International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0750.\n",
      "    Arrival at 0926 in George Bush Intercontinental Airport\n",
      "    97 minutes layover time.\n",
      "    Next leg departs at 1103 and lands at 1424 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 0750.\n",
      "    Arrival at 0926 in George Bush Intercontinental Airport\n",
      "    64 minutes layover time.\n",
      "    Next leg departs at 1030 and lands at 1342 in Southwest Florida International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1210.\n",
      "    Arrival at 1400 in Dallas/Fort Worth International Airport\n",
      "    115 minutes layover time.\n",
      "    Next leg departs at 1555 and lands at 1921 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1210.\n",
      "    Arrival at 1400 in Dallas/Fort Worth International Airport\n",
      "    110 minutes layover time.\n",
      "    Next leg departs at 1550 and lands at 1915 in Orlando International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1210.\n",
      "    Arrival at 1400 in Dallas/Fort Worth International Airport\n",
      "    75 minutes layover time.\n",
      "    Next leg departs at 1515 and lands at 1858 in Miami International Airport\n",
      "    \n",
      "\n",
      "    Flight departs from Mobile Regional Airport at 1210.\n",
      "    Arrival at 1400 in Dallas/Fort Worth International Airport\n",
      "    70 minutes layover time.\n",
      "    Next leg departs at 1510 and lands at 1653 in Pensacola International Airport (Pensacola Gulf Coast Regional Airport)\n",
      "    \n"
     ]
    }
   ],
   "source": [
    "# Get all possible flights from Alask to Florida with a single layover in a different state\n",
    "# of between 60 and 120 minutes\n",
    "\n",
    "nresults, ntime = NeoQuery(\n",
    "    \"\"\"\n",
    "    MATCH (ap1:Airport {state: 'AL'})-[:HAS_DEPARTURE]->(fl:Flight)-[:FLIES_TO]->(ap:Airport),\n",
    "          (ap)-[:HAS_DEPARTURE]->(fl2:Flight)-[:FLIES_TO]->(ap2:Airport {state: 'FL'})\n",
    "          \n",
    "    WITH fl, fl2, ap, ap1, ap2,\n",
    "         toInteger(left(fl.scheduled_arrival, 2)) * 60 + toInteger(right(fl.scheduled_arrival, 2)) as fl_arrival,\n",
    "         toInteger(left(fl2.scheduled_departure, 2)) * 60 + toInteger(right(fl2.scheduled_departure, 2)) as fl2_departure  \n",
    "    \n",
    "    WHERE (fl2_departure - fl_arrival) > 60 AND (fl2_departure - fl_arrival) < 120 AND ap.state <> 'FL' AND ap.state <> 'AL' AND fl.day = '1'\n",
    "    \n",
    "    RETURN DISTINCT ap1.name, fl.scheduled_departure, fl.scheduled_arrival, ap.name,\n",
    "                    fl2.scheduled_departure, fl2.scheduled_arrival, ap2.name, (fl2_departure - fl_arrival) as layover_time\n",
    "    \"\"\"\n",
    ").query(200)\n",
    "\n",
    "print(ntime)\n",
    "for record in nresults:\n",
    "    print(f\"\"\"\n",
    "    Flight departs from {record[0]} at {record[1]}.\n",
    "    Arrival at {record[2]} in {record[3]}\n",
    "    {record[7]} minutes layover time.\n",
    "    Next leg departs at {record[4]} and lands at {record[5]} in {record[6]}\n",
    "    \"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
